{"id":"an_autonomous_pixel_playground_crafting_interactive_onchain_games","name":"An Autonomous Pixel Playground: Crafting Interactive Onchain Games.","description":"In this workshop, we'll cover the process of permissionlessly creating pixel-based onchain games, using PixeLAW as our case study. Conversations on this topic are frequently theoretical; our workshop aims to shift that narrative by discussing the different stages of designing and building interactive and interoperable games. Namely,\n\n1. Initiation and building.\n2. Evolution through cooperation of different game creators and players.\n3. Emergence of new, unexpected gaming experiences.","start":1700118000000,"end":1700121600000,"stageId":"beylerbeyi_1","speakers":[{"id":"jk","name":"JK","bio":"John is a product-centered entrpreneur with 5 years of experience in crafting consumer software products in Europe and Asia. Having embraced Autonomous Worlds, he's part of PixeLAW to create a fully functional and interoperable pixel-based autonomous world.","eventId":"autonomous_worlds_assembly","twitter":"@OwnerOfJK","photo":"https://drive.google.com/uc?id=1z3QU8VU02oltE09THbx7gIORjmbgp4pA"},{"id":"syora","name":"Syora","bio":"Syora, a developer with 5 years' experience, recently completed Master's studies on image recognition deep learning. He served as the CTO of an AI company and ventured into the crypto realm last year, leading the creation of PixeLAW within the Autonomous World. Since assembling a team in July at an ETH Global hackathon, he's been driving PixeLAW's continuous development.","eventId":"autonomous_worlds_assembly","twitter":"@0xsyora","photo":"https://drive.google.com/uc?id=15WASxUGcWg9N6g-iiMNeeSy1gsvPN12f"},{"id":"caspar","name":"Caspar","bio":"Caspar, a seasoned tech executive, is the current CTO of Oost&Voort Inc. His 25-year career focuses on SaaS, Enterprise solutions, and DeFi among other areas. Caspar has been a significant figure in the Filipino blockchain community since 2017 and co-founded Blockdevs Asia. Currently, he's delving into Autonomous Worlds and Zero Knowledge Proofs with PixeLAW.\n","eventId":"autonomous_worlds_assembly","twitter":"@coostendorp_tw","photo":"https://drive.google.com/uc?id=1RYRzwG3jWBteN4KABRcFejxXRJZhIybg"}],"playbackId":"","eventId":"autonomous_worlds_assembly","coverImage":"/sessions/autonomous_worlds_assembly/an_autonomous_pixel_playground_crafting_interactive_onchain_games.jpg"}