{
    "id": "eth__ultrasound_money",
    "name": "ETH - Ultrasound Money",
    "description": "- Ethereum ekonomisinin geçmişi ve bugünü (Başlangıç, POS staking, EIP-1559, POS’a geçiş)\n- Önümüzdeki dönem nasıl şekillenecek? (neden ultrasound money deniyor?)\n",
    "start": 1699863300000,
    "end": 1699865100000,
    "stageId": "harbiye",
    "speakers": [
        {
            "id": "turan_sert",
            "name": "Turan Sert",
            "bio": "Finans ve teknoloji ağırlıklı bir geçmişe sahip olan Turan Sert, kariyerine Arthur Andersen’da denetim ve Garanti Bankası’nda yatırım bankacılığı ile başladı. Booz Allen New York ofisinde üç yıl süren yönetim danışmanlığı sonrası 2005 yılında Türkiye’ye döndü. Çeşitli Fiba Grubu iştiraklerinde murahhas azalık ya da yönetim kurulu üyelikleri ve 2014-16 yılları arasında Özyeğin Üniversitesi’nde CBO’luk görevinde bulundu. Önce kuruluşundan itibaren içinde yer aldığı Girişim Fabrikası, sonrasında da 2016 yılında kurduğu teknoloji girişimi ile Türkiye’deki ekosistemin büyümesine katkı sağladı. Halen BlockchainIST Center danışmanlık ve Paribu Danışma Kurulu üyeliği görevlerini sürdürmekte. 2019 yılında “Sorularla Blockchain” ve 2022 yılında “Sorularla DeFi - Merkeziyetsiz Finans” isimleriyle yayınlanan iki kitabı bulunmakta. Turan Sert, Boğaziçi Üniversitesi İşletme (BA, 1995) ve Harvard Business School (MBA, 2001) mezunudur.",
            "eventId": "ethgunu",
            "twitter": "@turansert",
            "photo": "https://github.com/ethgunu/ethgunu.com/blob/main/src/components/main/Speakers/photos/turan.png?raw=true"
        }
    ],
    "videoUrl": "https://lp-playback.com/hls/7b65cks3e3geruge/index.m3u8",
    "eventId": "ethgunu",
    "coverImage": "/sessions/ethgunu/eth__ultrasound_money_thumbnail.png",
    "assetId": "7b658157-5595-4f56-b5f3-cdb27b86e3ca",
    "sourceId": "627f0c12-cdbd-4337-a50a-3f27b82cd2c3",
    "videoType": "clip"
}