{
    "id": "glgeleri_aa_karmak_ethereum_ve_web3te_mahremiyet_labirentinde_yol_almak",
    "name": "Gölgeleri Açığa Çıkarmak: Ethereum ve Web3'te Mahremiyet Labirentinde Yol Almak",
    "description": "Ethereum tabanli Web3 ekosistemi içindeki mahremiyet endişeleri, farkındalığı ve çözümlerinin karmaşık ağına derinlemesine bir bakış sunar. İşlem ve işlevsel mahremiyet arasındaki ikilemi, Katman 1 ve ara yazılım mahremiyet çözümlerini inceler ve işlevsel mahremiyet içinde niyet tabanlı protokollerin alanına yolculuk yapar. Merkezi olmayan dijital gelecekte mahremiyet çerçevelerini, yasal uyumluluk çözümlerini dikkate sunmayı amaçlamaktadır.\n",
    "start": 1699869600000,
    "end": 1699871400000,
    "stageId": "harbiye",
    "speakers": [
        {
            "id": "isa_sertkaya",
            "name": "Isa Sertkaya",
            "bio": "İsa Sertkaya, Silent Protocol'de CTO olarak görev yapmakta ve mahremiyeti artıran protokoller, teknik özellikler, ürün vizyonları ve yol haritalarını şekillendirerek uluslararası kriptograflar, yazılım mühendisleri ve blockchain uzmanlarından oluşan bir ekibi yönetmektedir.\n\nSilent Protocol'a katılmadan önce, İsa TÜBİTAK BİLGEM Blokzincir Araştırma Laboratuvarı'nda Başuzman Araştırmacı olarak 20 yılı aşkın süreyle kriptografik protokol tasarımı ve analizi, kirptoparalar ve blokzincir teknolojileri konularında araştırmalar yaptı ve projeler yönetti. Görev süresi boyunca, 2013'te Matematiksel ve Hesaplamalı Laboratuvarı ve 2017'de Blockzincir Araştırma Laboratuvarı'nın kurulumunda bulundu.\n\nSilent Protocol'daki tam zamanlı görevlerinin yanı sıra, aynı zamanda misafir öğretim üyesidir, Koç Üniversitesi ve Orta Doğu Teknik Üniversitesi'nde kripto paralar ve blockchainler üzerine lisansüstü dersler verir ve kripto paralar ve blockchain teknolojileri üzerine mahremiyeti artıran ve sıfır bilgi protokollerini konu alan lisansüstü öğrencilerin tezlerini yönetmektedir.\n\nİsa lisans derecesini Matematik, yüksek lisans ve doktorasını Kriptografi alanında Türkiye, Ankara'daki Orta Doğu Teknik Üniversitesi'nden almıştır.",
            "eventId": "ethgunu",
            "twitter": "@isa_sertkaya",
            "photo": "https://github.com/ethgunu/ethgunu.com/blob/main/src/components/main/Speakers/photos/isa.jpeg?raw=true"
        }
    ],
    "videoUrl": "https://lp-playback.com/hls/62ef125mnddbokxt/index.m3u8",
    "playbackId": "62ef125mnddbokxt",
    "eventId": "ethgunu",
    "coverImage": "/sessions/ethgunu/glgeleri_aa_karmak_ethereum_ve_web3te_mahremiyet_labirentinde_yol_almak_thumbnail.png",
    "assetId": "62ef5790-0ce6-41d1-9265-f937b27c2450",
    "sourceId": "627f0c12-cdbd-4337-a50a-3f27b82cd2c3",
    "videoType": "clip"
}