{
  "id": "kripto_yasal_dzenlemeler",
  "name": "Kripto Yasal Düzenlemeler",
  "description": "Bu konuşmada Türkiye’de kriptopara yasal düzenlemelerini tarihsel bir gelişim ve uygulama örnekleri ile aktarmayı amaçlıyoruz. Bu kısa konuşma ile bu alanda çalışan kişilerin Türkiye’deki genel mevzuata hakim olmasını bekliyoruz.",
  "start": 1699871400000,
  "end": 1699875000000,
  "stageId": "beyazit",
  "speakers": [
    {
      "id": "elin_karatay",
      "name": "Elçin Karatay",
      "bio": "Elçin, teknoloji alanında sözleşme müzakereleri konusunda çalışmakta ve teknoloji şirketlerinin sözleşmelerini akılcı şekilde kurgulamaları konusunda hukuki destek sağlamaktadır. Teknoloji şirketlerinin her türlü stratejik ve ticari sürecine dahil olan Elçin; yazılım geliştirme, lisans, bakım ve destek sözleşmeleri, stratejik iş birliği, yatırım sözleşmeleri ile Birleşme ve Devralma süreçleri gibi konularda yerli ve yabancı müvekkiller ile çalışmaktadır. Bunun yanında high-tech alanında çalışan Elçin; blokzincir, kriptoparalar, yapay zeka gibi alanlarda Türkiye'de öncü şirketleri temsil etmektedir. \n\nYakın Zamanda Neler Yaptı?\n- Son bir yılda toplam değeri 100 milyon USD'ye yaklaşan teknoloji ve yazılım sözleşmelerinin müzakeresi\n- 20'den fazla Birleşme ve Devralma sürecini tamamlama\n- Türkiye'nin en büyük kripto varlık ihraçlarından 3 tanesinde hukuki danışmanlık\n- Blokzincir ve kripto varlıklar ile ilgili çalışan 30'dan fazla proje ve şirkete hukuki danışmanlık\n- Birçok devlet kurumu ve bakanlık, TÜBİTAK, BTK, FinTR gibi kurum ve kuruluşlar nezdinde eğitimler\n- Global Blockchain Business Council üyeliği ve International Journal of Blockchain Law’da co-editor görevi\n\nEğitim\n- Galatasaray Üniversitesi, Sosyal Bilimler Enstitüsü, Özel Hukuk Doktora – Devam Etmekte\n- Galatasaray Üniversitesi, Sosyal Bilimler Enstitüsü, Özel Hukuk Tezli Yüksek Lisans – Tez: ABD Hukuku kaynaklı SAFE'lerin Türk Hukuku kapsamında İncelenmesi (Girişim Sermayesi Yatırımları)\n- Koç Üniversitesi, Hukuk Fakültesi, Hukuk Lisansı\n\nÇalışma Alanları\n- Teknoloji Sözleşmeleri\n- Blokzincir ve Kripto Paralar\n- Yazılım ve Lisans Sözleşmeleri\n- Birleşme ve Devralmalar\n- İş birliği Sözleşmeleri\n\nÜyelikler\n- İstanbul Barosu\n- Global Blockchain Business Council\n- FinTR Yönetim Kurulu Üyesi\n- IR Global\n- International Bar Assocation\n- İTÜ Çekirdek, BAU Blockchain Center gibi kurumlarda mentor",
      "eventId": "ethgunu",
      "twitter": "@elcin_karatay",
      "photo": "https://github.com/ethgunu/ethgunu.com/blob/main/src/components/main/Speakers/photos/elcin.jpeg?raw=true"
    },
    {
      "id": "erdem_mmtaz_hacpaaolu",
      "name": "Erdem Mümtaz Hacıpaşaoğlu",
      "bio": "No description",
      "eventId": "ethgunu",
      "twitter": "@MumtazHcpsglu",
      "photo": "https://github.com/ethgunu/ethgunu.com/blob/main/src/components/main/Speakers/photos/mumtaz.jpeg?raw=true"
    }
  ],
  "videoUrl": "https://lp-playback.com/hls/6c11drxfj89abf9c/index.m3u8",
  "playbackId": "6c11drxfj89abf9c",
  "eventId": "ethgunu",
  "coverImage": "/sessions/ethgunu/kripto_yasal_dzenlemeler_thumbnail.png",
  "assetId": "6c111796-f917-401c-9f0d-67817f29526a",
  "sourceId": "5df00cb3-5321-4a04-aaf5-e37db723f73e",
  "videoType": "clip"
}