{
    "id": "dependency_funding_with_drips_v2",
    "name": "Dependency Funding with Drips v2",
    "description": "In this video, Eleftherios, the co-founder of the Radical Project, introduces DRIPS, a decentralized toolkit for funding public goods and open-source software. He discusses existing methods of funding and their limitations, highlighting the importance of interdependency. He explores the crypto Web3 space and mentions inspiring projects like Gitcoin and retroactive public goods funding. \n\nDRIPS takes a retroactive approach to funding and focuses on the interconnected nature of software and public goods. It offers continuous or recurring funding options and streamlines the funding experience for software projects. The core feature is a list that includes Ethereum addresses, ENS names, and Git repositories to allocate funds accordingly.\n\nAdditional tools within DRIPS simplify funding, including an identity solution using oracles and Chainlink. Continuous payments are emphasized for trust minimization assumptions and flexibility. The next iteration of the DRIPS toolkit is live, with a proposal to allocate $1 million from the RadWorks DAO.\n\nDRIPS enables possibilities like programmatically linking profits to dependencies, distributing native tokens to dependencies, issuing hyper-search for public goods contributions, and creating multi-party games within DAOs. Funding dependencies and creating cultural norms within the Web3 space are emphasized.\n\nThe video concludes with a Q&A session addressing questions about allocation percentages and decision-making processes within DRIPS. Eleftherios suggests looking at the work of the Optimism Collective for programmatically funding based on profitability.",
    "start": "2023-07-15T13:50:00.000Z",
    "end": "2023-07-15T14:20:00.000Z",
    "stageId": "farabeuf_amphitheater",
    "speakers": [
        {
            "id": "eleftherios_diakomichalis",
            "name": "Eleftherios Diakomichalis ",
            "bio": "No description",
            "eventId": "funding_the_commons_paris_2023"
        }
    ],
    "playbackId": "f097kdp3ga75tzb5",
    "eventId": "funding_the_commons_paris_2023",
    "coverImage": "/sessions/funding_the_commons_paris_2023/dependency_funding_with_drips_v2.jpg"
}