{
    "id": "priorities_for_public_goods_builders_in_2023",
    "name": "Priorities for Public Goods Builders in 2023",
    "description": "In this video, the speaker discusses the broad context of the current time period and reflects on the goals set out in the crypto field about a year ago. They emphasize the critical nature of this century and the need for systemic upgrades to navigate the challenges we face. The speaker highlights two major threads of technology development: blockchain and AI. They discuss how blockchain enables global scale coordination and coordination for better goals, while AI presents both capabilities and risks. The speaker also mentions the importance of funding public goods through crypto networks and leveraging AI capabilities to improve mechanisms. They discuss various funding mechanisms and coordination systems in the crypto space, as well as the potential for crypto networks to fund scientific research at a scale comparable to nation states. The speaker reviews the progress made in the community and project goals set in the previous year, highlighting successes and areas for improvement. They then outline community goals for 2023-2024, including growing events, expanding workshops and hackathons, formalizing community groups, and emphasizing performance evaluations. The speaker also presents project goals such as growing HyperCerts, scaling HyperCerts billboards, enabling reverse HyperCerts auctions, making impact evaluators on-chain observable and forkable, establishing network funds on-chain, developing IP NFTs, implementing aqueducts for blockchain networks to route value to public goods funding, creating an open-source funding alignment tool, and studying outcomes more robustly. The video concludes by emphasizing the potential of CryptoEcon to solve planetary problems but highlighting the need to do it well and study outcomes. The speaker acknowledges the challenges posed by CryptoWinter but expresses optimism for future growth in the crypto field.",
    "start": "2023-07-15T09:55:00.000Z",
    "end": "2023-07-15T10:25:00.000Z",
    "stageId": "farabeuf_amphitheater",
    "speakers": [
        {
            "id": "juan_benet",
            "name": "Juan Benet",
            "bio": "No description",
            "eventId": "funding_the_commons_paris_2023"
        }
    ],
    "playbackId": "9e3beiavxfquana8",
    "eventId": "funding_the_commons_paris_2023",
    "coverImage": "/sessions/funding_the_commons_paris_2023/priorities_for_public_goods_builders_in_2023.jpg"
}