{
  "id": "the_open_web_is_near_how_the_bos_ndc_and_daos_are_creating_a_decentralized_web",
  "name": "\"The Open Web is NEAR: How the BOS, NDC, and DAOs are creating a Decentralized Web\"",
  "description": "In this video, the speaker provides an update on the progress and goals of the crypto project called Near. Near aims to build a better web and believes in the open web concept. The project started with the idea of using AI to create any program or website, but pivoted to focus on blockchain technology. Near prioritizes simplicity for developers and end users, as well as security, scalability, and sustainability. The project is now transitioning into a blockchain operating system that brings together different ecosystems to contribute to the open web vision. The speaker discusses the importance of decentralization and highlights three pillars for further decentralizing the Near ecosystem: research and development, entrepreneurship and contribution, and community and governance. They also mention initiatives like Dev Hub, Near Horizon, and decentralized governance on the blockchain operating system. The video emphasizes the need for simplicity, inclusiveness, and accessibility in order to bring millions of users into the open web.\n\nThis text is a summary of a video about the crypto platform NIR. The speaker discusses the platform's history, its focus on simplicity and usability, and its mission to create an open web. They explain how NIR has evolved into a blockchain operating system that allows different ecosystems to contribute and collaborate. The video also highlights the importance of decentralization, research and development, entrepreneurship, and community governance in further decentralizing the NIR ecosystem. The speaker encourages developers to visit the NIR website and participate in building the open web. They also mention the platform's emphasis on diversity and inclusion in order to make participation accessible to all users.\n\nIn this video, the speaker provides an update on the progress of the Near blockchain ecosystem. They discuss the origins of Near, which started as a project focused on AI and freelancers using blockchain for payments. However, they realized that blockchain technology needed to be faster, cheaper, and more usable. As a result, they pivoted to become a layer one proof of stake blockchain with a focus on simplicity and mass adoption. The speaker also highlights the recent evolution of Near into a blockchain operating system, aiming to create an open web through multi-chain functionality, middleware, and an easy onboarding process called FastOS. They emphasize the importance of decentralization in achieving openness, inclusiveness, participation, and censorship resistance. The speaker then outlines three core pillars for further decentralization: research and development, entrepreneurship and contribution, and community and governance. They discuss specific initiatives within each pillar, such as the Dev Hub for developer contributions, NIR Horizon for gathering founders and backers, and decentralized governance through community-led initiatives. The video concludes with a focus on",
  "start": "2023-07-15T10:25:00.000Z",
  "end": "2023-07-15T10:45:00.000Z",
  "stageId": "farabeuf_amphitheater",
  "speakers": [
    {
      "id": "marieke_flament",
      "name": "Marieke Flament",
      "bio": "No description",
      "eventId": "funding_the_commons_paris_2023"
    }
  ],
  "playbackId": "869ehitkdoo69tly",
  "eventId": "funding_the_commons_paris_2023",
  "coverImage": "/sessions/funding_the_commons_paris_2023/the_open_web_is_near_how_the_bos_ndc_and_daos_are_creating_a_decentralized_web.jpg"
}