{"id":"the_multidisciplinary_web3_creativity__collaboration_panel","name":"The Multidisciplinary Web3: Creativity & Collaboration panel","description":"In this session we’ll discuss why blockchain technology has the powerful potential of furthering creativity in multidisciplinary digital art and beyond. Tokenization has equipped artists with the ability to create, authenticate, and distribute work using any digital or digitized medium. This fuel is the perfect catalyst for all artists, musicians, dancers, poets, actors, galleries, museums, curators, platforms, and even literary novel writers – to work together, without the overarching dominance of industries.\r\n\r\nYou will hear artists and innovators offer their personal insights on how the collaborative landscape of blockchain technology has led them to where they are now and what could be the possibilities of the future.","start":"2023-09-15T15:30:00-05:00","end":"2023-09-15T16:00:00-05:00","stageId":"michigan_stage__creatives__trad_business_","speakers":[{"id":"willea_zwey","name":"Willea Zwey","bio":"Willea Zwey is a multidisciplinary artist and musician based in Chicago. \r\nDrawing from her background in architecture, Willea’s artwork depicts otherworldly scenes with unconventional perspectives, surreal elements, and deep storytelling.\r\nSince her 2021 debut in the digital art world, Willea's distinctive styles have gained global recognition, with her artwork auctioned on platforms including Sotheby's and exhibited worldwide, including Times Square, New York, Tokyo, London, Dubai, and Hong Kong.","eventId":"ethchicago_2023","photo":"https://pretalx.com/media/avatars/Screen_Shot_2023-07-04_at_7.01.57_PM_qXtWIzP.png"},{"id":"noxis","name":"Noxis","bio":null,"eventId":"ethchicago_2023","photo":""},{"id":"sho","name":"Sho","bio":null,"eventId":"ethchicago_2023","photo":""}],"playbackId":"","eventId":"ethchicago_2023","coverImage":"/sessions/ethchicago_2023/the_multidisciplinary_web3_creativity__collaboration_panel.jpg"}