{"id":"what_does_it_mean_to_go_overseas__extraterritoriality_and_jurisdictional_considerations_in_crypto_operations","name":"What does it mean to go \"overseas\"?  Extraterritoriality and jurisdictional considerations in crypto operations.","description":"What does it mean to go \"overseas\"?  Extraterritoriality and jurisdictional considerations in crypto operations. Many crypto companies and start ups erroneously believe that forming an entity overseas will keep them immune from U.S. enforcement. This discussion will cover jurisdictional considerations, especially relating to regulatory issues.","start":"2023-09-17T13:30:00-05:00","end":"2023-09-17T14:00:00-05:00","stageId":"lincoln_stage","speakers":[{"id":"katherine_kirkpatrick","name":"Katherine Kirkpatrick","bio":"Katherine Kirkpatrick is the Chief Legal Officer of Cboe Digital. Prior to joining Cboe Digital, Katherine was General Counsel of Maple Finance, a capital-efficient corporate debt marketplace which facilitates crypto institutional borrowing via liquidity pools funded by the DeFi ecosystem. Before going “full-time crypto,” Katherine was a partner in the Special Matters and Government Investigations practice at King & Spalding, where she co-chaired the firm’s Financial Services Industry of Focus and the FinTech, Blockchain, and Cryptocurrency working group. In private practice, Katherine represented corporations and individuals under investigation by a large number of regulators, including the DOJ, SEC, CFTC, NFA, OFAC, FINRA, state AGs, the NY DFS, the Senate’s Permanent Subcommittee on Investigations, the OCC, and the Fed.  Katherine has extensive experience with digital assets and is a frequent writer and speaker on DeFi, cryptocurrency regulatory developments, anti-money laundering, and blockchain-related compliance. Katherine’s comments have been featured in publications such as the Financial Times, the American Banker, Coindesk, Reuters, and many others. In 2021, Katherine was recognized as “40 Under 40” by both Global Investigations Review and Benchmark Litigation. \r\n\r\nKatherine earned her undergraduate degree from the University of Southern California and her J.D. from Notre Dame Law School, where she serves on the Executive Advisory Committee of the board.","eventId":"ethchicago_2023","photo":"https://pretalx.com/media/avatars/Headshot_iIB2lS0.jpg"}],"playbackId":"","eventId":"ethchicago_2023","coverImage":"/sessions/ethchicago_2023/what_does_it_mean_to_go_overseas__extraterritoriality_and_jurisdictional_considerations_in_crypto_operations.jpg"}