{
  "id": "blockchain_enabled_social_purpose_value_chains_organizing_to_address_the_un_sdgs",
  "name": "Blockchain Enabled Social Purpose Value Chains: Organizing to Address the U.N. SDGs",
  "description": "Innovations in governance will be critical if we are going to address grand societal challenges identified by the U.N. SDGs. Research is underway to design a value-chain level blockchain based governance and operations model to effectively support the achievement of a range of pressing humanitarian social goals (e.g., stable global supply of food, access to affordable housing, regional circular economies). Called the “Social Purpose Value Chain” (SPVC), this system level concept is based on the idea that a combination of blockchain technology, coopetition, reimagination of value-chain analysis in the context of social goal achievement, a relational bureaucratic governance model that is vertically integrated (i.e., shared governance by members of each step of a value chain), and a social credit incentive system would overcome several known barriers to social goal achievement (e.g., such as power and hierarchy issues in decision making, donor-driven solutions that do not effectively or efficiently address needs, contract execution failures). The SPVC concept, the status of the software research prototype supporting it, and next steps will be discussed.",
  "start": 1694959200000,
  "end": 1694961000000,
  "stageId": "michigan_stage__creatives__trad_business_",
  "speakers": [
    {
      "id": "carolee_rigsbee_sheher",
      "name": "Carolee Rigsbee (she/her)",
      "bio": "Carolee Rigsbee, PhD, has extensive project management and QA leadership experience gained through her work in the nuclear R&D, aerospace & defense, telecom, food manufacturing, advisory services, and higher education industries.  Specializing in strategic management as an academic, her research is focused on the design of organization governance and value chain structures and processes that strengthen stakeholder voice and reduce obstacles to the achievement of societal goals.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/Rigsbee_AND9csR.jpg"
    },
    {
      "id": "carol_m_jessup",
      "name": "Carol M. Jessup",
      "bio": "Carol M. Jessup is Professor Emerita of Accountancy at the University of Illinois Springfield.  Her Ph.D. in Business Administration is from Saint Louis University (major in Management, minor in Public Policy Studies) and BA and MA degrees in Accounting from the former Sangamon State University. \r\n \r\nCarol primarily taught auditing and governmental and nonprofit accounting, with her research interests extending to include fraud.  She was the inaugural Editor-in-Chief of The North American Accounting Studies and former chair of the Editorial Board for the Journal of Government Financial Management of the Association of Government Accountants.   She currently serves on the Governmental Accounting Auditing and Financial Reporting Technical Advisory Board for the Government Finance Officers Association and the Board of the United Way of Central Illinois.  Carol was honored by the Illinois CPA Society in September 2020 with its Experienced Leader award.\r\n\r\nApart from her academic experience, Carol held several positions in state and local government.  She was a grant accountant, an internal auditor, served as a staff member of the team that implemented Generally Accepted Accounting Principles (GAAP) in the State of Illinois, managed a municipal finance department, and provided expert witness testimony in utility regulatory proceedings.  She is a licensed CPA in Illinois and a Certified Fraud Examiner.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/caroljessup_PJEXWav.jpg"
    },
    {
      "id": "stephen_r_newell",
      "name": "Stephen R Newell",
      "bio": null,
      "eventId": "ethchicago",
      "photo": ""
    }
  ],
  "source": {
    "streamUrl": "https://lp-playback.com/hls/a74dmy8t0vvqjvdt/index.m3u8",
    "start": 775,
    "end": 1873
  },
  "playbackId": "",
  "eventId": "ethchicago",
  "coverImage": "/sessions/ethchicago/blockchain_enabled_social_purpose_value_chains_organizing_to_address_the_un_sdgs.jpg"
}