{
  "id": "decentralized_commerce_comes_to_web3_what_it_is_and_what_it_means_for_brands",
  "name": "Decentralized commerce comes to web3: what it is and what it means for brands",
  "description": "The burgeoning world of web3 is creating new opportunities for brands to connect with target audiences in meaningful ways, writes VMLY&R Commerce's McDonald Predeleus.",
  "start": 1694964600000,
  "end": 1694966400000,
  "stageId": "east_room__main_",
  "speakers": [
    {
      "id": "mcdonald_predelus",
      "name": "Mcdonald Predelus",
      "bio": "McDonald is currently leading Web3 and innovation at VMLY&R COMMERCE. He is working with agency clients to assist them in their collaborations with brands, social platforms, and emerging channels. McDonald's main responsibility is to guide clients towards the forefront of the future of commerce in the Web3 space. McDonald has a strong knowledge of gaming and web 3 culture, which allows him to use his expertise to deliver innovative solutions that enable clients to stay ahead of the game in this rapidly evolving digital landscape. \r\n\r\nCurrent Clients: Coca-Cola, Mondelez, General Mills, Molson Coors Ford, WPP OpenX Team \r\n\r\nWith a portfolio of successful projects, McDonald has led award-winning activations for some of the biggest names in the industry, including American Express, Verizon, AT&T, Mondelez, and McDonald's. \r\n\r\nIn 2011, McDonald founded Ghostskate, a community-based skate organization with locations in New York, Chicago, and Web3 space. The organization has grown to become the largest skate meet-up group in the United States. McDonald is a multi-talented individual, who brings his passion for learning and growth to his work as a creative director. He is also an artist, writer, designer, wrestling coach, and part-time stand-up comedian.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/McDonaldPredelis_image_gdMMXqX.png"
    }
  ],
  "playbackId": "",
  "eventId": "ethchicago",
  "coverImage": "/sessions/ethchicago/decentralized_commerce_comes_to_web3_what_it_is_and_what_it_means_for_brands.jpg"
}