{
  "id": "decentralized_wireless_networks",
  "name": "Decentralized Wireless Networks",
  "description": "Now anyone can become a cellular provider! How anyone can build their own cellular network.",
  "start": 1694883600000,
  "end": 1694885400000,
  "stageId": "lincoln_stage__builder__legal",
  "speakers": [
    {
      "id": "cullah",
      "name": "Cullah",
      "bio": "Cullah is the Founder of NFTMKE, the Milwaukee Web3 Community and Firebird Media, a Web3 Creator Protocol providing next generation tools and infrastructure for creators and their communities using disruptive technologies like blockchain and artificial intelligence\r\n\r\nCullah is an open-source musician, engineer, and entrepreneur who has released hundreds of original songs and compositions placed in productions for The Expendables 4, The North Face, The Modern Rogue, and Channel 4. As well as video games like D.R.O.N.E the Game, Those Who Remain, Stickman Rope Hero, and Car Mechanic Simulator 2018. \r\n\r\nhttps://cullah.com/epk",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/84138847_10158056861966663_1087440755334578176_n_UO854H5.jpg"
    },
    {
      "id": "russell_from",
      "name": "Russell From",
      "bio": "Russell From is the VP of Deployment for Hexagon Wireless, a decentralized telecommunications startup which recently deployed 21 blockchain powered cellular sites in Milwaukee. Russ previously worked as the Enterprise Services Security Specialist Lead for Tanium where he led Tanium’s Enterprise Services to enable public and private organizations to utilize Tanium’s real-time endpoint management and visibility technology. Previously, Russ was a Senior Network Security Engineer for US Cellular where he defended customers and business partners by focusing on proactive network behavior analysis, network forensics, mobile malware identification and remediation, DDoS defense, and threat intelligence automation. Russ also defended the largest electronic medical records vendor in the US as the Network Security lead on IPS, IDS, Network Decryption, Traffic Analysis, and Network Security Response on fully Micro-Segmented & Multi-Tenant infrastructure. Before moving to the defensive side of cyber security, Russ had 8 years of technical experience including being a Principal Network Engineer where he worked to build the first public cloud infrastructure for North America’s largest wireless telecommunications carrier. Russ currently holds the CISSP, GCPM, GCLD, GMON, GCIA, GCIH, and GSEC Gold certifications. Russ also has a bachelor’s from UW-Madison in Computer Engineering, an MBA from Marquette University, and was in the first class of graduates from Milwaukee’s Forward48, a public service focused leadership program. Russ’ hobbies and interests include bass fishing, residential solar, gorwing his Threefold decentralized server farm, and working on small engines.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/Russ-From-Security-Hacker-Wisconsin_2xSnqSw.jpg"
    },
    {
      "id": "joe_petrungaro",
      "name": "Joe Petrungaro",
      "bio": "Joe Petrungaro is a Network Infrastructure Engineer with over 11 years of industry experience. He career began in Marine Corps Communications, where he worked with numerous facets of traditional network infrastructure, satellite communication, and ANW2 digital radios. After four years of honorable service, Joe transitioned to the realm of enterprise networking. Since then, he has held various roles in managed services and as an independent consultant, focusing on design and integration of core routing/switching, high density wireless deployments, and network security. Joe's hobbies consist of playing guitar, contributing to the DeWi community, and coding.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/temp_image_20230908_170037_efe1033d-bccc-41d8-8639-9baca1faf8b6-cropped_AqHsrlF.jpg"
    }
  ],
  "playbackId": "",
  "eventId": "ethchicago",
  "coverImage": "/sessions/ethchicago/decentralized_wireless_networks.jpg"
}