{"id":"digital_identity_in_a_decentralized_future","name":"Digital Identity in a Decentralized Future","description":"In an increasingly interconnected world, the need for decentralized identity solutions has become paramount, with implications spanning industries, technologies and global societies. Eth Chicago is proud to present a thought-provoking discussion the delves into the heart of this issue with \"Navigating Digital Identity in a Decentralized Future.\"","start":1694896200000,"end":1694899800000,"stageId":"east_room__main_","speakers":[{"id":"spencer_graham","name":"Spencer Graham","bio":"Spencer is a DAO operator, mechanism designer, and smart contract engineer. He has been enamored with Ethereum since 2017 and has worked full time for and in DAOs since 2020, primarily with Raid Guild and DAOhaus. Based on his experiences in DAOs, Spencer cofounded Hats Protocol to help DAOs and other organizations be capture-resistant *and* get work done effectively.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/unnamed_A1gvV2C.png"},{"id":"erika_knierim","name":"Erika Knierim","bio":"Erika is an attorney, legal engineer and finance professional with 14+ years of experience working with organizations ranging from international investment banks to multi-billion dollar technology startups. \r\n\r\nShe is an advocate for her client’s goal of maximizing value whether in the courtroom or an investment portfolio. This desire led to acquiring deep knowledge of how tokenization and blockchain technologies are affecting finance and the law. Beginning with crypto-finance, she has become an expert in topics ranging from tokenization and supply chains to NFTs and smart contracts and how they affect a company's profitability and growth. \r\n\r\nOver the past two years, she has worked on the frontline of blockchain regulatory law and become intimately knowledgeable on the changing global regulatory landscape for cryptocurrency, working directly with several regulatory governing bodies and leading legal blockchain authorities. Through extensive access to leading industry players, she came to believe in the need for greater adoption of emerging blockchain solutions by legacy institutions and the need for strong regulatory solutions that protect consumers but still encourage innovation. \r\n\r\nIn addition to her work with Nomic, Erika also serves as an Executive Team Lead for the Tokenized Commodities Council where she is spearheading the creation of a digital commodities taxonomy and as a Mentor for the WAC (Web3 Arts & Culture) Fellowship, where she helps arts institutions navigate the blockchain ecosystem.\r\n\r\nHer work is driven by a desire to create agency in a technological world, support physical engagement, ensure safety and security, expand a sense of ownership in the world we inhabit, and facilitate the preservation of assets and memories.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/EK-White_oqkJlD5.png"},{"id":"james_quinn","name":"James Quinn","bio":"James Quinn is a senior advisor at Q9, a digital asset investment and SaaS platform\r\ndelivering cutting edge solutions and capabilities to crypto and financial services firms. He is\r\nalso founder of Horizon Partners, a business consultancy network.\r\n\r\nJames is a seasoned leader and entrepreneur having led financial services businesses and\r\nnew ventures across multiple asset classes in Asia, North and South America. He has 25\r\nyears of experience in capital markets and fintech with a focus on client service, trading and\r\nrisk management.  \r\n\r\nBefore joining Q9, James previously served as Managing Director at Deutsche Bank in\r\nequity derivatives, leading their index trading business across APAC. He has also held\r\nsenior positions at Credit Suisse and The MTI Company.\r\n\r\nJames holds a Masters of Business Administration (MBA) from the University of Chicago\r\nBooth School of Business in analytical finance, statistics and economics.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/James_Quinn_Photo_pYXnICb.jpg"},{"id":"ed_zabar","name":"Ed Zabar","bio":"Ed Zabar has over 25 years of experience in Entrepreneurship, Technology, Finance, and Management. Ed’s most recent endeavor, Ed founded Verif-y, Inc. which he now manages as the CEO.\r\nPrior to founding Verif-y, Ed served as a turnaround CEO of a UK technology company with $40M in revenues, where he returned the company to profitability and facilitated its sale.\r\nEd was also a senior investment banker with several leading boutique firms in New York, Washington DC and Philadelphia. In these roles, Ed specialized in Mergers and Acquisitions, and funding of early and expansion-stage Technology, Media, and Telecom companies. After achieving great success as the Managing Director at Oberon Securities, Ed was named as both COO and CTO. His influence was fundamental to the management team's success in propelling the investment bank to a strong market position.\r\nPrior to his work as an investment banker, Ed was a Vice President at a New York-based venture capital firm as well as a US/Hong Kong family office. While there, he executed multiple transactions with technology companies in various stages of development. Prior to these roles, Ed served as an Executive Vice President of sales and marketing at ViewTrade Securities, where he was instrumental in increasing the company's global client base and its revenues from $500,000 to over $15M. In addition, Ed was a financial and technology consultant at Goldman Sachs and PwC where he advised many Fortune 500 financial services and manufacturing firms. Ed also co-founded and exited two technology startups in the late 90's early 2000's.\r\nEd holds an MBA from Columbia University and a BS in Finance and Information Technology from New York University.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/Ed_smile_aXC6Kd8.JPG"}],"playbackId":"","eventId":"ethchicago","coverImage":"/sessions/ethchicago/digital_identity_in_a_decentralized_future.jpg"}