{
  "id": "education_over_speculation",
  "name": "Education over Speculation",
  "description": "There’s a great danger in the crypto space to over-emphasize the investment side and underestimate the value of education. Join the discussion by educators and culture leaders.",
  "start": 1694977200000,
  "end": 1694979000000,
  "stageId": "east_room__main_",
  "speakers": [
    {
      "id": "cullah",
      "name": "Cullah",
      "bio": "Cullah is the Founder of NFTMKE, the Milwaukee Web3 Community and Firebird Media, a Web3 Creator Protocol providing next generation tools and infrastructure for creators and their communities using disruptive technologies like blockchain and artificial intelligence\r\n\r\nCullah is an open-source musician, engineer, and entrepreneur who has released hundreds of original songs and compositions placed in productions for The Expendables 4, The North Face, The Modern Rogue, and Channel 4. As well as video games like D.R.O.N.E the Game, Those Who Remain, Stickman Rope Hero, and Car Mechanic Simulator 2018. \r\n\r\nhttps://cullah.com/epk",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/84138847_10158056861966663_1087440755334578176_n_UO854H5.jpg"
    },
    {
      "id": "chris_vrakas",
      "name": "Chris Vrakas",
      "bio": "Chris Vrakas is a boundary-pushing, inquisitive, and lifelong learner known for challenging the status quo. Embracing interdisciplinary exploration, he's a tech enthusiast, Bitcoin advocate, hacker, philosopher, writer, and observer of political and economic landscapes. With over a decade of experience in the music industry, Chris has been a DJ, producer, talent buyer, event coordinator, nightlife consultant, artist manager, and owner of successful nightclubs, Oak Lounge and Site 1a, in Milwaukee. He partnered with React Presents, producing over 700 concerts and festivals including booking Kaskade, The Chainsmokers, Zeds Dead, Paul Oakenfold and hundreds of others. After selling Site 1a in 2019, Chris redirected his focus towards the cryptocurrency industry.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/FB_IMG_16944739587202_HDVADQt.jpg"
    },
    {
      "id": "kinchasaeth",
      "name": "Kinchasa.eth",
      "bio": "Kin is the founder of Idiotb0x, a fledgling startup working at the intersection of AI and web3 and was a founding member of the Defiant Pixel Society. \r\n\r\nKin has been pulling at the thread of web3 since 2018 trying to take in the full potential of blockchain as a new medium akin to digital marble. He spent much of that time in the NFT scene as an ENS maxi and fairy, with a collection of on-chain pixel art only rivaled by Moderats. He is a poet of sorts having founded Cipher - a collectible hip hop platform, a pixel artist and occasional raider in the Raid Guild.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/H6jivT1P_400x400_SRrg9ev.jpg"
    },
    {
      "id": "nathaniel_stern",
      "name": "Nathaniel Stern",
      "bio": "Nathaniel Stern is a Professor, Researcher, Director of UWM Startup Challenge + Autism Brilliance Lab. \r\n\r\nHe has produced and collaborated on projects ranging from ecological, participatory, and online interventions, interactive, immersive, and mixed reality environments, to prints, sculptures, videos, performances. and hybrid forms. His first book, Interactive Art and Embodiment: The Implicit Body as Performance (Gylphi 2013), takes a close look at the stakes for interactive and digital art, and Ecological Aesthetics: artful tactics for humans, nature, and politics (Dartmouth 2018) is a creative and scholarly collection of stories about art, artists, and their materials, which argues that ecology, aesthetics, and ethics are inherently interconnected, and together act as the cornerstone for all contemporary arts practices. \r\n\r\nHe has been featured in the likes of the Wall Street Journal, Guardian UK, Huffington Post, Daily Mail, Washington Post, Daily News, BBC’s Today show, WIRED, Boing Boing, Gizmodo, PetaPixel, M Magazine, Time, Forbes, Fast Company, Scientific American, the Milwaukee Journal Sentinel, Leonardo Journal of Art, Science and Technology, Rhizome, Furtherfield, Turbulence, and more.",
      "eventId": "ethchicago",
      "photo": "https://pretalx.com/media/avatars/download_ci5BmHs.jpeg"
    }
  ],
  "playbackId": "",
  "eventId": "ethchicago",
  "coverImage": "/sessions/ethchicago/education_over_speculation.jpg"
}