{
    "id": "innovations_in_the_build_environment",
    "name": "Innovations in the build environment",
    "description": "1 or 2 people, the founders of Duo. Carlos Robles-Shanahan and Rafael Robles\r\n\r\nDuo is a Chicago-based innovation studio/lab with the mission to create built environment innovations for the benefit of society. Duo's signature design methodology, Multicontextual Design, promotes norm/form-making which enables us to (re)shape dominant norms and set new precedents through our work.\r\n\r\n\r\nThe presentation will give a foundation of the importance and impact of real estate assets on the unequal distribution of wealth in the United States, and follow it with a presentation of two projects that will be among the first in Chicago to use equity crowdfunding to open investment opportunities for commercial and residential buildings to neighbors and non-accredited investors. The presentation can finish with an open conversation about how ETH, Blockchain and other emerging technologies can further promote ethical interventions in physical environments.",
    "start": 1694961000000,
    "end": 1694962800000,
    "stageId": "michigan_stage__creatives__trad_business_",
    "speakers": [
        {
            "id": "rafael_robles",
            "name": "Rafael Robles",
            "bio": "Rafa Robles is the co-founder and director of Duo. An innovation studio/lab that works to create built environment innovations for the benefit of society, Duo partners with organizations of all types through design, strategy, and innovation services, and by launching ethical real estate development and related ventures. Duo’s multicontextual design approach investigates and activates knowledge, wisdom, and beauty across a generative and evaluative process that explores Norm/Form-making. Their studio applies the lenses of economics, ecology, technology, culture, and ethics to enrich their practice and ensure that their innovations provide a societal benefit. Prior to Duo, Rafa’s work spanned design and innovation at Doblin (a Deloitte business), real estate development at Ranquist Development Group, and architecture at Studio Gang Architects. Since 2011, Rafa has produced numerous projects ranging from research to implementation across contexts and scales. His diverse body of work spans and crosses the boundaries of innovation, design, and business strategy, real estate development, urban planning, building and spatial design, digital ecosystems, visual and graphics, user experiences, and service design.",
            "eventId": "ethchicago",
            "photo": "https://pretalx.com/media/avatars/rrobles_NhVOHwi.jpeg"
        },
        {
            "id": "carlos_roblesshanahan",
            "name": "Carlos Robles-Shanahan",
            "bio": "Carlos Robles Shanahan is the co-founder and director of Duo. An innovation studio that works to create built environment innovations for the benefit of society, Duo partners with organizations of all types through design, strategy, and innovation services, and by launching ethical real estate development and related ventures. Duo’s multicontextual design approach investigates and activates knowledge, wisdom, and beauty across a generative and evaluative process that explores Norm/Form-making. Their studio applies the lenses of economics, ecology, technology, culture, and ethics to enrich their practice and ensure that their innovations provide a societal benefit. Prior to Duo, Carlos worked as a strategy consultant for the Monitor Institute by Deloitte, as a researcher at the University of Michigan, and as a Chicago Public School teacher. His work spans the development and implementation of initiatives related to organizational strategy, education, immigration, economic development, and urbanization. Carlos earned a master’s in public policy from the University of Michigan, a bachelor of arts and science degree from Loyola University Chicago, and an associate’s degree from Harper College.",
            "eventId": "ethchicago",
            "photo": "https://pretalx.com/media/avatars/CM-duo-12_A5VAtIN.jpeg"
        }
    ],
    "source": {
        "streamUrl": "https://lp-playback.com/hls/a74dmy8t0vvqjvdt/index.m3u8",
        "start": 2255,
        "end": 3665
    },
    "playbackId": "",
    "eventId": "ethchicago",
    "coverImage": "/sessions/ethchicago/innovations_in_the_build_environment.jpg"
}