{
    "id": "protect_your_creations_copyright_trademark_and_ip",
    "name": "Protect your creations, Copyright, trademark and IP",
    "description": "Explore the exciting fusion of technology and law, promising a deep dive into the dynamic realm where blockchain redefines how IP is protected, monitored, and enforced in our increasingly digitized world.",
    "start": 1694809800000,
    "end": 1694811600000,
    "stageId": "michigan_stage__creatives__trad_business_",
    "speakers": [
        {
            "id": "eliana_torres",
            "name": "Eliana Torres",
            "bio": "Eliana is an attorney in the Intellectual Property Group at Nixon Peabody LLP, where she co-chairs the AI, Web3, and Metaverse in IP Team. \r\n\r\nEliana focuses her practice on trademarks, copyrights, and technology transactions, and her passion lies in the rapidly evolving fields of NFTs, AI, and emerging technologies. \r\n\r\nAfter being introduced to the blockchain, she became an avid collector of NFTs, where she witnessed the many issues involving IP. It was then that she decided to use her unique ability to translate complex IP   issues into actionable solutions to empower innovators in various industries. Prior to joining Nixon, Eliana practiced as a Trademark Attorney for the United States Patent and Trademark Office.\r\n\r\nEliana believes in the mission of her practice group- “innovation is the currency of our practice.”",
            "eventId": "ethchicago",
            "photo": "https://pretalx.com/media/avatars/62892BB3-C6F9-4E61-AEC5-89253E6BB9B1_wIsih8X.jpeg"
        },
        {
            "id": "idong_ebong",
            "name": "Idong Ebong",
            "bio": null,
            "eventId": "ethchicago",
            "photo": ""
        },
        {
            "id": "nelson_rosario",
            "name": "Nelson Rosario",
            "bio": "Rosario Tech Law, LLC is a boutique law firm focused on companies building the new economy and changing the world.\r\n\r\nRTL was founded by Nelson M. Rosario a tech lawyer and adjunct law professor whose commentary and analysis has been featured in the New York Times, TechCrunch, CoinDesk, Law360 and other publications.\r\n\r\nMr. Rosario is licensed to practice in the State of Illinois and before the United States Patent & Trademark Office. Mr. Rosario is focused on working with clients dealing with emerging technologies that are changing the way we think about privacy, property, and power.",
            "eventId": "ethchicago",
            "photo": "https://pretalx.com/media/avatars/nelsonrosario_COXcsx3.jpg"
        }
    ],
    "playbackId": "",
    "eventId": "ethchicago",
    "coverImage": "/sessions/ethchicago/protect_your_creations_copyright_trademark_and_ip.jpg"
}