{
    "id": "rescue_or_destroy",
    "name": "Rescue or Destroy",
    "description": "Art lovers and enthusiasts are invited to embark on a journey of self-discovery and exploration. If you find yourself captivated by the allure of art, spending endless hours admiring masterpieces from afar, and eagerly anticipating art shows and open studios, then \"Rescue or Destroy\" is the event yoååu've been waiting for.\r\n\r\nExperience the thrill of Rescue or Destroy as art takes center stage in a unique and exhilarating concept. Attendees will be faced with a transformative decision - the fate of the art is in their hands. Each piece showcased during the event will confront one of tow possible destinies.\r\n\r\nFirst, Passionate and decisive art lovers have the opportunity to take ownership of their favorite pieces by purchasing them directly from the event. Embrace the power to claim the object of your affection and bring it home to grace your walls, becoming a part of your daily life.\r\n\r\nSecondly, the evening holds a more daring and dramatic outcome - certain artworks will meet their end. Witness the spectacle of a large, bearded, bald man with an ax, as he skillfully transforms the pieces into hundreds of tiny fragments. It's a captivating moment that underlines the significance of every decision made.\r\n\"This is the antidote to indecision,\" says the event organizer, \"I've seen it firsthand: She who hesitates is heartbroken.\" At \"Rescue or Destroy,\" there's no room for vacillation. Embrace your love for art and participate actively in its destiny or let it burn to the ground and make way for the new.\r\n\r\n\"Rescue or Destroy\" encourages attendees to take control of their passions, embracing a sense of agency in the art world. Don't let others dictate the fate of the pieces you adore. This event celebrates the joy of art, the thrill of ownership, and the courage to let go.",
    "start": 1694820600000,
    "end": 1694824200000,
    "stageId": "michigan_stage__creatives__trad_business_",
    "speakers": [
        {
            "id": "allen_vandever",
            "name": "Allen Vandever",
            "bio": "Hello! My name is Allen Vandever. For those of you who don’t know me, I am contemporary Artist Based out of Chicago. I am a father, husband, and a son. Family and friends are very important to me. I have lived my life with the goal of making every year worthy of a good movie or a great book. I take risks, embrace adventure and live life to the fullest. And as a result, I have many wonderful stories. I minted my first NFT 2013 before NFT were even a thing I am always way to early. I love working with good people I have become pat of the ImnotArt team this year and working on a new project SUP!? With my good friend Eric Bobby. I run Childhood Fractured this is a non-profit humanities-based human rights initiative centered on preventing the sexual abuse and exploitation of children.",
            "eventId": "ethchicago",
            "photo": "https://pretalx.com/media/avatars/822BB6FD-5C09-49E9-BFDB-4229F9AE01F1_2p9V1jg.jpeg"
        }
    ],
    "playbackId": "",
    "eventId": "ethchicago",
    "coverImage": "/sessions/ethchicago/rescue_or_destroy.jpg"
}