{"id":"the_future_adoption_of_blockchain","name":"The Future Adoption of Blockchain","description":"Blockchain is an incredible tool that has applications across multiple industries.  This talk is aimed at providing a look at what industries are likely to adopt blockchain next and what that adoption might look like.","start":1694971800000,"end":1694973600000,"stageId":"michigan_stage__creatives__trad_business_","speakers":[{"id":"bobbie_rachford","name":"Bobbie Rachford","bio":"With over 15 years of experience in the life sciences industry and seven years in blockchain, Robert \"Bobbie\" Rachford is a confluence of cutting-edge knowledge and hands-on application. Armed with a master's degree in Biostatistics, Bobbie is able to leverage his expertise to lead a team of statisticians and statistical programmers to prove new drugs are safe and effective.\r\n\r\nBobbie's footprint extends beyond life sciences. In Chicago's burgeoning blockchain sphere, he's become an influential figure. He is the founder of the Chicago Off-Chain Global chapter, the city's fastest-growing real-life meetup group spotlighting blockchain. Moreover, as a core member of ETHChicago, Bobbie is at the forefront of building and promoting an annual three-day conference/hackathon focused on blockchain's tangible applications in everyday scenarios.\r\n\r\nBranching out further, Bobbie founded BlockAdopt. This innovative media venture is more than just news articles; it's a comprehensive database detailing blockchain adoption across various industries, underlining that its utility stretches far beyond finance.\r\n\r\nBobbie's conviction in blockchain technology's revolutionary potential is steadfast. He's not merely a passive spectator but an active participant, driving its integration across sectors. With a vision of a universally impacted future, he's ensuring our path to a more transparent and efficient world is both accelerated and safeguarded.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/Bobbie_from_Defi_Part_Time_1_XTPxuhk.PNG"}],"playbackId":"","eventId":"ethchicago","coverImage":"/sessions/ethchicago/the_future_adoption_of_blockchain.jpg"}