{"id":"collaborative_spirit_in_nfts_building_communities","name":"Collaborative Spirit in NFTs: Building Communities","description":"Panel with artists SenorPantsNFT, Sabet, Wondermundo and and Nima Beheshtian, Founder and CEO of Layerr","start":1702159200000,"end":1702161000000,"stageId":"base_house","speakers":[{"id":"eric_spivak","name":"Eric Spivak","bio":"Eric “Motivate” Spivak is an Educator,\nTrusted Advisor & Key Opinion Leader\nin the Blockchain Space\nEmerging Tech & Web3 World.","eventId":"base_event","twitter":"@EricSpivak"},{"id":"senorpantsnft","name":"SenorPantsNFT","bio":"Artist masquerading as a Revenue Operations executive. Out of my comfort zone on purpose. Adding value to the space with art, humor, and meaningful conversation","eventId":"base_event","twitter":"@SenorPantsNFT"},{"id":"sabet","name":"Sabet","bio":"Sabet is an Iranian-American artist and the creator of TokyoPunks NFT. More info can be found here: https://www.sabet.art/about","eventId":"base_event","twitter":"@sabet\n"},{"id":"wondermundo","name":"Wondermundo ","bio":"Hi. My name is Jessica (aka Wonder) and I’m a first generation Mexican-American multimedia artist with over 20 years experience in content, learning, and collaboration design. I entered the NFT space last April after rediscovering my own art.\n\nNow, I’m all in web3 selling my art as NFTs and helping projects scale.\n\nI joined the NFT space in April of 2021 as an artist and have a collection of 300 NFTs.\n\nMy artistic work is minted on my own $wonder contract by Manifold and platforms such as Makersplace, Foundation, OpenSea, Objkt.com, Versum, FxHash, Paras, and Exchange.art.\n\nI am also a community builder and helped build a couple early NFT communities like #famjam and #smolgang in 2021. Currently, I am working to build 0xTHULU.\n\nI aim to educate, empower, and uplift others through my platform and experience.","eventId":"base_event","twitter":"@wondermundo"},{"id":"nima_beheshtian","name":"Nima Beheshtian\n ","bio":"Founder and CEO of Layerr","eventId":"base_event"}],"playbackId":"","eventId":"base_event","coverImage":"/sessions/base_event/collaborative_spirit_in_nfts_building_communities.jpg"}