{
    "id": "fireside_chat_with_jack_butcher",
    "name": "Fireside Chat with Jack Butcher",
    "description": "",
    "start": 1702141200000,
    "end": 1702143000000,
    "stageId": "base_house",
    "speakers": [
        {
            "id": "jack_butcher",
            "name": "Jack Butcher",
            "bio": "I'm Jack. \n‍\nI spent 10 years working in Fortune 100 advertising in NYC as a designer, writer, strategist and art director for multi-billion dollar brands.\n‍\nFun, but the opposite of freedom.\n\nSo, in search of freedom, I started my own advertising agency. \n\nNo fun, and even less freedom.\n‍\nAfter two years of iteration, I figured out how to transition to highly-specialized (and fun) consulting, and a product business that serves 6,000 people around the world.\n‍\nThe insight behind this transition?\n\nProductizing myself.\n\nVisualize Value is the product of that transition, a project I've used to build a network of mentors, a $1M/year product business, and a media platform with an audience of over 700,000 people.\n‍\nIf you'd have told me this story 18 months ago, I wouldn't have believed you.\n\nNow I spend all of my time making things that make it easier to learn, teach, build, and sell.",
            "eventId": "base_event",
            "twitter": "@jackbutcher"
        },
        {
            "id": "jesse_pollak",
            "name": "Jesse Pollak",
            "bio": "Jesse Pollak is Creator of Base. Prior to Base, Jesse led all of Coinbase’s consumer-facing engineering from early 2017 to middle 2021, including building Coinbase, Coinbase Pro, and Coinbase Wallet. Jesse joined Coinbase through the acquisition of Clef, a company he founded and ran for five years that built passwordless identity solutions for crypto companies.\n",
            "eventId": "base_event",
            "twitter": "@jessepollak\n"
        }
    ],
    "videoUrl": "https://lp-playback.com/hls/2e66a6pwj7i4dhad/index.m3u8",
    "playbackId": "2e66a6pwj7i4dhad",
    "eventId": "base_event",
    "coverImage": "/sessions/base_event/fireside_chat_with_jack_butcher.jpg",
    "assetId": "2e667129-92e4-424e-a9e5-3c9b19b33e86",
    "sourceId": "bbb47859-f5a3-4406-a53d-60c1e539646e",
    "videoType": "clip"
}