{
    "id": "how_to_create_fun_with_yu_cai_varkito_and_olivia_pedigo",
    "name": "\nHow to create fun with Yu Cai, Varkito, and Olivia Pedigo",
    "description": "mint.fun’s Manny is joined by artists Yu Cai, Varkito, and Olivia Pedigo, who are each dropping an Edition using create.fun for Base at Basel. ",
    "start": 1702062000000,
    "end": 1702063800000,
    "stageId": "base_house",
    "speakers": [
        {
            "id": "manny_palou",
            "name": "Manny Palou",
            "bio": " manny404 is an NYC based engineer and software artist who’s been involved in crypto art since 2018. In 2021 he launched his own NFT collection and community called “mannys.game”. Currently he works on mint.fun as an engineer specializing in the client experience.",
            "eventId": "base_event",
            "twitter": "@mannynotfound"
        },
        {
            "id": "yu_cai",
            "name": "Yu Cai",
            "bio": "Yu Cai is a Chinese animator/illustrator based in Italy, and an artist in the NFT space. Yu creates works that serve as mirrors of contemporary urban existence, vividly illustrating alternative modes of inhabiting the modern landscape. Her imaginative vision offers glimpses into uncharted territories of living, challenging conventional notions and inviting viewers to explore fresh perspectives on our relationship with the urban environment.\n\nWith over a decade of professional experience, her art has been showcased internationally in numerous galleries and museums. Yu previously pursued a career as a painter and printmaker and was affiliated with the Italy National Association of Contemporary Engravers. However, in 2020, she discovered a deep passion for digital art and has since fully embraced it as her primary medium of expression.",
            "eventId": "base_event",
            "twitter": "@yucai_yu"
        },
        {
            "id": "varkito_garcia",
            "name": "Varkito Garcia",
            "bio": "From Dominican Republic and the web. Their work includes computer drawings, installations and audiovisuals. Founder of the experimental creators community El Cuarto Elástico.",
            "eventId": "base_event",
            "twitter": "@Varkitogarcia1"
        },
        {
            "id": "olivia_pedigo",
            "name": "Olivia Pedigo",
            "bio": "Olivia Pedigo (b. 2000) is a Miami native 3D artist, animator, and graphic designer. Before graduating from the University of Florida in 2022 with a degree in Public Relations and a minor in Digital Arts and Sciences, Olivia gained experience as a gallery assistant at the Gainesville Fine Arts Association and as a merchandise designer for the on-campus publication Rowdy Magazine during her time in school.\n\nOver the past four years, Olivia's work has evolved to reflect a dreamscape where comfort and isolation intersect, notably seen in her 'bedroom pieces.' These scenes, devoid of human presence yet filled with character, explore the relationship between individuals and their possessions, with a focus on technology. She draws inspiration from childhood influences like Dr. Seuss and contemporary artists such as Jiayi Li, Nathalie Nguyen, and Hilma af Klint.\n\nIn early 2022, Olivia entered the web3 space, venturing into the world of NFTs. Since then, her work has found a home in hundreds of collections. Notable collectors include Terrell Jones, Vincent Van Dough, and Bongdoe. Her journey was highlighted in a feature by \"It's Nice That,\" a globally recognized platform for the creative community.\n\nOlivia has exhibited her creations at Lume Studios in New York City, NFTNYC 2023, and SHILLR's mobile gallery.",
            "eventId": "base_event",
            "twitter": "@oliviapedi"
        }
    ],
    "playbackId": "d8c7i3sfnwhly2q7",
    "eventId": "base_event",
    "coverImage": "/sessions/base_event/how_to_create_fun_with_yu_cai_varkito_and_olivia_pedigo.jpg",
    "assetId": "d8c7e5d4-a5e4-4b49-a846-a8b7109d6761",
    "sourceId": "1179590f-51c1-4672-b037-25e1fe8ef31f",
    "videoType": "clip"
}