{"id":"layerr_session_digital_marketing_mastery_for_artists_utilizing_layer_2_platforms","name":"[layerr session]\nDigital Marketing Mastery for Artists: Utilizing Layer 2 Platforms","description":"Panel with artists Sabet, Gabe Weiss, and EmpressTrash and Nima Beheshtian, Founder and CEO of Layerr. Provide marketing tips and strategies, focusing on how Layer 2 platforms can aid in online promotion and community building.","start":1702065600000,"end":1702067400000,"stageId":"base_house","speakers":[{"id":"sabet","name":"Sabet","bio":"Ali Sabet is an Iranian-American artist and designer. His work shines with vibrant optimism, love and beauty in the face of it all.","eventId":"base_event","twitter":"@sabet\n"},{"id":"gabe_weiss","name":"Gabe Weiss","bio":"Gabe Weis is a mixed-media and NFT artist living in the Bay Area. The self-taught artist is inspired by street art and stoic philosophy and uses a stream-of-consciousness approach to his work to explore perceptions of reality. \nHis physical and digital works are shown internationally. This past year, his work has been shown at the Venice Biennale, Picasso Museum, Seattle Art Fair, and various galleries throughout Asia and the United States. \nGabe recently launched The Stoics, a 5,000-piece NFT collection that sold out in minutes and represents his personal philosophy of resilience through stoicism. \nGabe is committed to sustainability in his craft.  By reusing older materials found around the house such as cereal boxes, maps, and old dictionaries to create timeless works, he hopes his work inspires others to reuse materials as part of their art practice. ","eventId":"base_event","twitter":"@GabrielJWeis"},{"id":"empress_trash","name":"Empress Trash ","bio":"Empress Trash is a multi-versatile visual artist currently residing in Mexico City with her rottweiler Glitch. A lifelong artist, she earned her BFA in Painting, Drawing, and Animation/Design from the University of Iowa in 2014. Shortly after, she moved to the Bay Area which she assisted and worked alongside a multitude of local and international artists and shows including Ai Wei Wei’s show on Alcatraz, being a member of the Firehouse Art Collective run by Tom Franco, and running her own underground shows from her house. She started in crypto art in 2021 and since has been exhibited internationally including Tokyo, Seoul, NYC, Paris, Palm Springs, Miami, Rome, LA, SXSW, Mexico City, Melbourne with Sotheby's, SuperChief, Nox Gallery, Aeon Studioverse, Oshi Gallery, Unit London, Flux Collective, imnotArt and Ted Talks Conference in Vancouver. ​\n\nThe Empress portion of her name represents her ongoing search for sovereignty and elevated autonomy since emancipated herself from her extremely physically, mentally, sexually and spiritually abusive Schizophrenic, addict mother at the age of 13, while Trash stands for her aesthetic and her roots as \"trailer trash\". Art for her is the only constant in a tumultuous life and a safe space to confront demons from a highly isolated, oppressive and chaotic upbringing while critiquing systemic inequities and media representation of feminity in what has been called \"a playfully controversial manner\".​\n\nAs a process orientated artist, Empress embraces abstraction, surrealism, trash, glitch, and AI while exploring new technologies intergrating and experimenting as she goes. She utilizes radical expressionism and self-acceptance to further her journey of self discovery while exploring topics of intersectional feminism, consumerism and mass media. Her work is meditative and strives to peel back the veneer of reality to allow for exploration of the subconscious meta connections between the emotional, physical, mental, sexual and spiritual realms. \n\n​","eventId":"base_event","twitter":"@EmpressTrash"},{"id":"nima_beheshtian","name":"Nima Beheshtian\n ","bio":"Founder and CEO of Layerr","eventId":"base_event"},{"id":"eric_spivak","name":"Eric Spivak","bio":"Eric “Motivate” Spivak is an Educator,\nTrusted Advisor & Key Opinion Leader\nin the Blockchain Space\nEmerging Tech & Web3 World.","eventId":"base_event","twitter":"@EricSpivak"}],"playbackId":"","eventId":"base_event","coverImage":"/sessions/base_event/layerr_session_digital_marketing_mastery_for_artists_utilizing_layer_2_platforms.jpg"}