{"id":"an_introduction_to_bootstrapping_for_approximate_homomorphic_encryption","name":"An Introduction To Bootstrapping for Approximate Homomorphic Encryption","description":"By default noisy homomorphic encryption schemes, such as the ones based on the Ring-Learning-With-Errors problem, can only evaluate a limited number of operations before decryption is required. \n\nBootstrapping is the ability for such a scheme to evaluate its own decryption circuit under encryption. This enables these schemes to perform an unlimited (or practically unlimited) number of operations without requiring intermediate decryption.\n\nThis talk will give an introduction to the concept of bootstrapping for approximate homomorphic encryption, a homomorphic encryption scheme that enables encrypted fixed point arithmetic over the complex field.\n\nThe aim of the talk is for the participant to understand how the process of bootstrapping for such a scheme works and what the current state of the art is.\n\nPrior knowledge of this specific scheme is not required, but some familiarity with the concept of Ring-Learning-With-Errors and polynomial rings is recommended.","start":1700211600000,"end":1700213400000,"stageId":"dolmabahce_b__c","speakers":[{"id":"jeanphilippe_bossuat","name":"Jean-Philippe Bossuat","bio":"Jean-Philippe Bossuat started working on lattice-based fully homomorphic encryption in 2019 at the Laboratory for Data Security (LDS) at EPFL.\n\nDuring his time at the LDS, Jean-Philippe co-authored the library Lattigo, a well established Go module that implements Ring-Learning-With-Errors based homomorphic-encryption and Multiparty-Homomorphic-Encryption based protocols.\n\nHe is currently employed at Tune Insight SA as a cryptography software engineer specialized in fully homomorphic encryption. \n\nHis work focuses on maintaining the Lattigo library to the state-of-the-art, and researching, designing, implementing and optimizing FHE-based applications for privacy-preserving analytics and machine learning.\n\n","eventId":"progcrypto","twitter":"","photo":"https://drive.google.com/file/d/10z_D0ctEUK6-cCEqEAps4Di66ReupJHd/view"}],"playbackId":"","eventId":"progcrypto","coverImage":"/sessions/progcrypto/an_introduction_to_bootstrapping_for_approximate_homomorphic_encryption.jpg"}