{"id":"on_achieving_anonymity_and_confidentiality_trustlessly_approaches__challenges","name":"On Achieving Anonymity and Confidentiality Trustlessly: Approaches & Challenges","description":"For building an application with trust-minimized privacy guarantees, how should one decide between zkSNARKs, FHE, MPC, trusted execution environments (TEEs), oblivious RAM (ORAM), and etc.? This talk will take a deep dive on how application and infrastructure designers should navigate this space.\n\nThroughout the talk, we will be using a handful of examples with case studies: dark pools (Renegade, Penumbra), private voting w/ anti-collusion (MACI), and card games (zkHoldem, Nouns private voting proposals). The talk proceeds in three parts.\n\n1. Application semantics: what is the functionality requirement of the application? Does the application demand *anonymity* for certain users or *confidentiality* of certain information? Does the application need *deniability*?\n2. Selection of tech based on feature requirement: we will survey the techniques that can best offer each feature, e.g. usage of zk shielded pools, shuffles, or ORAM for anonymity, and usage of threshold FHE or MPC for confidentiality.\n3. Patterns & challenges: we will list a number of challenges with building a full stack solution that utilizes more than one technology. For example: How to efficiently connect zk circuits to FHE ciphertext & MPC secrets? If and how can we make threshold decryption committees accountable?","start":1700134200000,"end":1700135400000,"stageId":"auditorium","speakers":[{"id":"wei_dai","name":"Wei Dai","bio":"My background is in Cryptography, having focused on concrete provable security during my PhD, advised by Mihir Bellare. My current interest is broadly in the applications of cryptography to trust-minimized applications, as a researcher, builder, and investor. My goal is to push the space of trust-minimized applications forward, by identifying and contributing to high impact research areas, facilitating technology transfer from research to applications, and in supporting projects and founders closely during the early stages. I believe that Programmable Cryptography uniquely enables the addition of privacy and scalability to trust-minimized applications. I strive to stay at the forefront of the theory, implementation, and commercialization of this area of technology.\n\nSome examples of my recent work:\n- My work on FLAX (https://eprint.iacr.org/2021/1249.pdf) led to a Ethereum privacy project called Nocturne (https://nocturnelabs.xyz/), of which I'm a core protocol designer.\n- My work on PESCA (https://eprint.iacr.org/2022/1119.pdf) was one of the first to propose the usage of threshold FHE to build on-chain confidential compute. This design has since been practically implemented in efforts such as fhEVM by Zama.","eventId":"progcrypto","twitter":"","photo":"https://drive.google.com/file/d/1QU2d9WDateEo7pI0PLfaU5fKdtszCjhj/view"}],"playbackId":"","eventId":"progcrypto","coverImage":"/sessions/progcrypto/on_achieving_anonymity_and_confidentiality_trustlessly_approaches__challenges.jpg"}