{
  "id": "programming_zk_with_ezkl",
  "name": "Programming ZK with EZKL",
  "description": "ZK is one of the most powerful techniques in programmable cryptography. The computational graphs behind AI/ML are the most widely deployed and understood circuit language. I'll talk about how we've made it fast and easy to program ZK with ezkl using these graphs, and some thoughts on where programmable cryptography is going next.",
  "start": 1700226000000,
  "end": 1700227800000,
  "stageId": "auditorium",
  "speakers": [
    {
      "id": "jason_morton",
      "name": "Jason Morton",
      "bio": "Jason currently holds the position of Co-Founder / CEO at Zkonduit, a company specializing in making zero-knowledge easier through the use of high-level program descriptions. Prior to this, he was an Associate Professor at Penn State where he applied his expertise in algebraic geometry and tensor networks to the fields of statistics, computer science, and quantum information. Jason's academic journey began at Harvard University where he earned his A.B. in Psychology. He then pursued an M.A. in Economics from the University of Michigan. His passion for mathematics led him to the University of California, Berkeley, where he obtained his Ph.D. in Mathematics with a dissertation on \"Geometry of conditional independence,\" under the guidance of advisor Bernd Sturmfels. With a deep understanding of information-processing systems, Jason's work often revolves around exploring the common mathematical foundations across different fields. His current venture, Zkonduit's EZKL, simplifies zero-knowledge proofs with a particular focus on AI/ML models and other computational graphs, making it a trusted tool for data privacy and verification.",
      "eventId": "progcrypto",
      "twitter": "",
      "photo": "https://drive.google.com/uc?id=1zPU6xPxGoEuiEk1asyJ5Xea_i7f5COI5"
    }
  ],
  "playbackId": "e39am4org19iovkp",
  "eventId": "progcrypto",
  "track": "Libraries and Infrastructure",
  "coverImage": "/sessions/progcrypto/programming_zk_with_ezkl_thumbnail.png",
  "assetId": "e39a33e8-fb5b-43ca-b83f-ea9a4171ee53",
  "sourceId": "17264d1b-22cb-4510-a583-837293741512",
  "videoType": "clip"
}