{
  "id": "why_isnt_privacy_a_thing_learnings_from_semaphore_a_case_study",
  "name": "Why isn't privacy a \"thing\"? Learnings from Semaphore: A case study",
  "description": "In this talk, I'll delve into an examination of Semaphore, a widely acknowledged yet underexploited Zero-Knowledge (ZK) primitive, through the eyes of the builders leveraging it and potential users. \"Privacy is a fundamental right,\" yet there is a chasm between the recognized potential and actual utilization of privacy technologies like Semaphore in real-world applications. This session aims to foster a deep, collective reflection on the barriers, breakthroughs, and uncharted pathways in Semaphore’s journey, and by extension, the trajectory of privacy technologies at large. This talk will leverage the results of the User Research I conducted for the Semaphore team, and present its outcomes and how others in the ZK and Privacy can benefit from its findings. ",
  "start": 1700206200000,
  "end": 1700207100000,
  "stageId": "dolmabahce_b__c",
  "speakers": [
    {
      "id": "launamu",
      "name": "LauNaMu",
      "bio": "LauNaMu, is a strategy and impact evaluation researcher with over 5 years in the Web3 and Fintech spaces. She has collaborated with the Ethereum Foundation, Optimism Foundation, and worked for Branch International, and Revolut. In the public domain, she's worked with governments from Mexico to Singapore, emphasizing impact evaluation and public policy.  She's designed monitoring processes embraced by more than 30 consulates and embassies and scaled startups to reach 1 million USD in disbursements weekly.  LauNaMu is passionate about harnessing technology to uplift lives, with a keen focus on emerging markets.",
      "eventId": "progcrypto",
      "twitter": "",
      "photo": "https://drive.google.com/file/d/1wz-LnvBvgKnG8E9NqNGWgt9Gv-cb2S7B/view"
    }
  ],
  "playbackId": "",
  "eventId": "progcrypto",
  "track": "Cryptography in the Wild",
  "coverImage": "/sessions/progcrypto/why_isnt_privacy_a_thing_learnings_from_semaphore_a_case_study_thumbnail.png"
}