{"id":"zkp2p_review_getting_a_zk_app_from_poc_to_production","name":"ZKP2P Review: Getting a ZK App from PoC to Production","description":"Right now, there are only a handful of ZK apps in production. This contrasts with the number of ZK apps in the proof of concept stage or ZK infra providers. It's currently difficult to bring a ZK app to production, and similar to trying to productionize smart contract protocols in 2018, there are no best practices for devs to follow yet. The talk will revolve around our journey in getting ZKP2P from a winning hackathon project in April at ZKHack Lisbon to production. We'll cover the tradeoffs between privacy vs speed, client side proving UX, shared security between smart contract and circuits, and reflections on using ZK as the solution to solve the onramping problem in crypto. We hope our insights in the talk will incentivize more ZK app builders to bring their proof of concept apps to production, and start the discussion around best practices to do so","start":1700215200000,"end":1700216100000,"stageId":"dolmabahce_b__c","speakers":[{"id":"richard_liang","name":"Richard Liang","bio":"I am currently a PSE grantee as part of the ZKP2P project. We are building the first trustless P2P onramp powered by ZK proofs in close collaboration with the ZKEmail team. Previously, I was part of the founding team at Set Protocol where we built a DeFi index protocol and launched some popular financial products that reached >$500M in assets. Additionally, I built / contributed to a few open source ZK libraries: RSA in Noir and verifying a chain of x509 certificates in halo2. Most of my experience is in building fullstack apps / smart contract protocols, which require connecting all parts of the stack and delivering an end product to the user. ZK is the newest layer in the stack, and I'm excited to get innovative ZK powered apps into the hands of users (e.g. ZKP2P when we launch)","eventId":"progcrypto","twitter":"","photo":"https://drive.google.com/file/d/1AAim8Zx_BiAHUzzGCDQo5NjotfEcZiFM/view"}],"playbackId":"","eventId":"progcrypto","coverImage":"/sessions/progcrypto/zkp2p_review_getting_a_zk_app_from_poc_to_production.jpg"}