{
  "id": "indexing_ethereum_mainnet_for_nearzero_cost",
  "name": "Indexing Ethereum Mainnet for Near-Zero Cost",
  "description": "A discussion about EVM client software, why it can't deliver accurate transactional histories (hint: it's missing an index), and what it would be like if it could.",
  "start": 1694764800000,
  "end": 1694766300000,
  "stageId": "atelier__side_stage",
  "speakers": [
    {
      "id": "thomas_jay_rush",
      "name": "Thomas Jay Rush",
      "bio": "Thomas Rush is the founder of TrueBlocks.io, a blockchain-focused consultancy and software company delivering fast, usable data from the blockchain. Rush is a two-time recipient of Ethereum Foundation grants, a Moloch DAO grant recipient, an active community member, and also the founder of the Philadelphia Ethereum Meetup group. In a former life, Rush taught undergraduate writing at the Community College of Philadelphia. Rush holds a Master of Fine Arts in Poetry from Rosemont College and a Master of Science in Computer Science from the University of Pennsylvania.",
      "eventId": "protocol_berg",
      "photo": "https://speak.protocol.berlin/media/avatars/Head_Shot_CR1JFsY.jpg"
    },
    {
      "id": "dawid_szlachta",
      "name": "Dawid Szlachta",
      "bio": "Dawid Szlachta is TrueBlocks’ lead developer. Before joining TrueBlocks, Szlachta spent eight years sharpening his skills on various large-scale web applications. However, he is now more interested in developing local-first and privacy friendly software powered by Ethereum and IPFS. He holds a bachelor’s degree in Philology from the University of Warsaw and lives with his wife in Kraków, Poland.",
      "eventId": "protocol_berg",
      "photo": "https://speak.protocol.berlin/media/avatars/Profilowe_rgCru5p.jpeg"
    }
  ],
  "playbackId": "",
  "videoUrl": "https://lp-playback.com/hls/9724a6rgnwkw3mm0/index.m3u8",
  "eventId": "protocol_berg",
  "coverImage": "/sessions/protocol_berg/indexing_ethereum_mainnet_for_nearzero_cost.jpg"
}
