{
  "id": "operationlevel_concurrent_transaction_execution_for_ethereum",
  "name": "Operation-level Concurrent Transaction Execution for Ethereum",
  "description": "Despite the success in various scenarios, blockchain systems, especially EVM-compatible ones that serially execute transactions, still face the significant challenge of limited throughput. Concurrent transaction execution is a promising technique to accelerate transaction processing and increase the overall throughput. Existing concurrency control algorithms, however, fail to obtain enough speedups in real-world blockchains due to the high-contention workloads.\r\n\r\nIn this talk, I will propose a novel operation-level concurrency control algorithm designed for blockchains.\r\nThe core idea behind our algorithm is that only operations depending on conflicts should be executed serially, while all other conflict-free operations can be executed concurrently. Therefore, in contrast to the traditional approaches, which block or abort the entire transaction when encountering conflicts, our algorithm introduces a redo phase to resolve conflicts at the operation level by re-executing conflicting operations only. We also develop a set of data dependency tracking mechanisms to achieve precise identification and speedy re-execution for conflicting operations. We implement a prototype named ParallelEVM based on Go Ethereum and evaluate ParallelEVM using real-world Ethereum blocks. The evaluation results show that ParallelEVM achieves an average speedup of 4.28×. If combined with state prefetching techniques, ParallelEVM can further accelerate the transaction execution by 7.11×.",
  "start": "2023-09-15T15:30:00.000Z",
  "end": "2023-09-15T15:55:00.000Z",
  "stageId": "atelier__side_stage",
  "speakers": [
    {
      "id": "yajin_andy_zhou",
      "name": "Yajin (Andy) Zhou",
      "bio": "My name is Yajin Zhou. I am a ZJU 100-Young professor (since 2018), with the College of Computer Science and Technology at Zhejiang University. I earned my Ph.D. (2015) in Computer Science from North Carolina State University. I am the co-founder of BlockSec, a startup dedicated to building blockchain security infrastructure.\r\n\r\nI have published more than 50 papers, with 8500+ citations (Google Scholar). One of my papers has been selected to the list of normalized Top-100 security papers since 1981. I was recognized as the Most Influential Scholar Award for my contributions to the field of Security and Privacy.\r\n\r\nMy current research spans traditional ones (software security, operating systems security and hardware-assisted security) and emerging areas (security of smart contracts, decentralized finance (DeFi) security, and the underground economy.)\r\n\r\nI have served on the program committee for multiple prestigious security conferences and as a reviewer for National Research Foundation Singapore and ANR (Agence Nationale de Recherche).",
      "eventId": "protocol_berg",
      "photo": "https://speak.protocol.berlin/media/avatars/Xnip2023-05-29_22-50-08_OsPVvPC.jpg"
    }
  ],
  "playbackId": "",
  "eventId": "protocol_berg",
  "coverImage": "/sessions/protocol_berg/operationlevel_concurrent_transaction_execution_for_ethereum.jpg"
}
