{
    "id": "the_nature_of_the_protocol",
    "name": "The Nature of the Protocol",
    "description": "Since 2019, we’ve been studying the novel dynamics unlocked by crypto protocols,  articulating new mentals model for understanding them, such as \"headless brands\" and \"squad wealth.\" Since our work on public goods and with our experience as researchers and builders, our thinking has taken a more deeply political turn as we consider the long-term impact of crypto protocols as institutional bodies.\r\n\r\nInstitutional legitimacy and accountability of actors are problems which recur time and again as critical themes in protocol development and operations. Attempts to solve these problems are very wide-ranging, drawing from notions of the state (DAO constitutionalism) to corporations (coin-voting shareholder governance). As a result, protocol work has become a byzantine maze of narratives and mismatched mental models which are often a poor fit for the technical affordances of blockchains.\r\n\r\nIn this keynote talk, we will share insights from 5 years of techno-cultural analysis in the crypto space. We'll then present several frameworks that reveal how accountability and legitimacy arise—or don't—in crypto protocols. Drawing from legal and political theory (featuring pirates), we'll share a political philosophy of crypto institutions that will help protocol stewards and core developers understand power, behavioral regulation, and even violence in the nature of the protocol.",
    "start": 1694797200000,
    "end": 1694798700000,
    "stageId": "magazin__main_stage",
    "speakers": [
        {
            "id": "toby_shorin",
            "name": "Toby Shorin",
            "bio": "Toby Shorin\r\nToby Shorin is a writer and technologist based in New York and the cofounder of Other Internet Research Institute. His research examines the moral genealogy of technological and cultural evolution.",
            "eventId": "protocol_berg",
            "photo": "https://speak.protocol.berlin/media/avatars/headhshot_ROxYJPz.jpg"
        },
        {
            "id": "laura_lotti",
            "name": "Laura Lotti",
            "bio": "Researcher at Other Internet investigating the institutional affordances of blockchain protocols",
            "eventId": "protocol_berg",
            "photo": "https://speak.protocol.berlin/media/avatars/LL-pic_aK1B8rK.jpg"
        },
        {
            "id": "sam_hart",
            "name": "Sam Hart",
            "bio": "Sam is the Head of Product and Strategy at Skip, a team building MEV solutions that improve protocol sustainability and cross-chain UX. He is also Co-founder of Timewave, an organization that creates tools for intelligent on-chain resource allocation and trustless cooperation.",
            "eventId": "protocol_berg",
            "photo": "https://speak.protocol.berlin/media/avatars/headshot_square_jSlIGp9.jpeg"
        }
    ],
    "playbackId": "",
    "videoUrl": "https://lp-playback.com/hls/b58akjrz8343cmgk/index.m3u8",
    "eventId": "protocol_berg",
    "coverImage": "/sessions/protocol_berg/the_nature_of_the_protocol.jpg",
    "assetId": "b58a0bf3-4924-4dbc-acaa-a2a04a6b409c"
}