{"id":"gabby_kusz","name":"Gabby Kusz","bio":"Gabriella Kusz currently serves as the Sr. Director of Operations at the Digital Dollar Project - a neutral, non-profit forum focused on exploring digital innovation in money and future-proofing the U.S. Dollar in a world of decentralized and centralized sovereign and non-sovereign digital currency networks. Ms. Kusz previously served as CEO of the Global Digital Asset and Cryptocurrency Association, a global voluntary self-regulatory association for the industry. In this capacity she has earned accolades by Wirex on their Rising Women in Crypto Power List 2022, by CoinGape as one of their Top Crypto CEOs in the World, and most recently by the American Banker as one of the 20 ‘Most Influential Women in Fintech 2023’ award. Given her strong focus on small and medium business development, the Global DCA heavily emphasized capacity building advisory work. Due to this emphasis, the Global DCA competed against and beat for-profit firms to receive the Corporate Livewire Innovation Award for 'Cryptocurrency Advisory Company of the Year.\" \r\n\r\nPrior to joining the Global DCA, Gabriella Kusz served as the Principal for Strategic Initiatives at the International Federation of Accountants (IFAC) where, in addition to other areas, she supported the profession’s leadership and innovation in the digital era and in sustainability. Her role as IFAC Principal as well as Senior Manager emphasized supporting the four international standards setting boards which operate under the auspices of IFAC (IAASB, IPSASB, IESBA and IAESB) to advance adoption and implementation of international standards in 100+ jurisdictions around the world. Under her care, IFAC developed and implemented the roll out plan in 100+ countries around the world for the amended International Standards of Quality Management (ISQM). \r\n\r\nHer background has largely included working in international financial sector reform and economic growth including working with the World Bank Group Governance Global Practice where she was responsible for leading the Corporate Governance and Financial Reporting (CGFR) workstream for the Middle East and North Africa (MENA) region and advancing the dual goals of the World Bank: poverty reduction and shared prosperity. She has also co-led USAID Projects which not only emphasized international standards but the measurement and reporting of alignment / adoption and implementation of international standards through benchmarking and indexing. Her experience spans 56 countries and has fostered the growth of 28 self-regulating associations around the world. \r\n\r\nGabriella is a licensed CPA in the state of Virginia, holds her Masters in Public Policy from Georgetown University, her Masters in Business Administration and Bachelors of Accounting from the University of Dayton as well as certificates in International Financial Reporting Standards (AICPA), the Global Reporting Initiative (GRI) Certificate in Sustainability Reporting Standards and is one credit shy of her Certificate in Arabic Language and Cultures from the University of Chicago. Gabriella recently concluded her year-long service as an Emerging Leader with the Chicago Council on Global Affairs and presently sits on the Georgetown University McCourt School of Public Policy Alumni Board. Gabriella is fluent in English and Spanish and has a beginning level of knowledge in Arabic.","eventId":"ethchicago","photo":"https://pretalx.com/media/avatars/Screen_Shot_2023-09-10_at_4.41.49_PM_znKT2vz.png"}