{
    "id": "the_importance_of_resisting_censorship_how_activists_can_use_blockchain_as_a_tool",
    "name": "The importance of resisting censorship: how activists can use blockchain as a tool",
    "description": "Panel discussion",
    "start": "2023-06-22T15:30:00.000Z",
    "end": "2023-06-22T16:00:00.000Z",
    "stageId": "main",
    "speakers": [
        {
            "id": "nadya_tolokonnikova",
            "name": "Nadya Tolokonnikova",
            "bio": "conceptual artist, musician, political activist (Pussy Riot)\nNadya Tolokonnikova is a founding member of Pussy Riot, the feminist protest art movement that now counts hundreds of people among its numbers.\nShe was sentenced in 2012 to two years imprisonment following “Punk Prayer,”  an anti-Putin performance piece she and conspirators staged inside a cathedral in Moscow. She started a hunger strike protesting the conditions in which she was being held and was ultimately sent to a Siberian penal colony before being released in December 2013.\nShe was declared a “foreign agent” by Russia in 2021 and has lived in exile ever since. \nShe is a co-founder of the independent news service and media outlet Mediazona. She co- founded UnicornDAO to create equality and visibility for women-identified and lgbtq+ artists in the crypto/web3 space, and was instrumental in raising more than $7 million in support of Ukraine via UkraineDAO. \nShe has spoken before the US Congress, British Parliament and European Parliament. \nShe collaborated with Bansky on his “Dismaland” exhibition and created an immersive experience at the Saatchi Gallery in London. She is the author of Read & Riot: A Pussy Riot Guide to Activism.",
            "eventId": "swarm_summit_2023",
            "photo": "https://summit.ethswarm.org/media/avatars/Nadya_Tolokonnikova_MucJ2J1.jpg"
        },
        {
            "id": "scott_beibin",
            "name": "Scott Beibin",
            "bio": "inventor, artist, agent, researcher, self-taught engineer, maker and do-er of things",
            "eventId": "swarm_summit_2023",
            "photo": "https://summit.ethswarm.org/media/avatars/scott-beibin-480x481_I3GTAXc.jpg"
        },
        {
            "id": "mike_bonnano",
            "name": "Mike Bonnano",
            "bio": "Activist, performer, artist",
            "eventId": "swarm_summit_2023",
            "photo": "https://summit.ethswarm.org/media/avatars/mike_bonanno_portrait_zrsB8Ab.jpg"
        },
        {
            "id": "lou_de_kerhuelvez",
            "name": "Lou de Kerhuelvez",
            "bio": "Lou is a governance researcher exploring alternative economic, justice, and political systems to mitigate for existential challenges. \n\nOver the last six years, Lou has been accelerating visions of a technologically-advanced future with the Foresight Institute, while fostering a global, multidisciplinary, and decentralized scientific community.\n\nThrough the Embassy Network and Feytopia, Lou has been developing location-based and transnationally networked communes experimenting with new forms of governance and solidarity.\n\n\nAs a steward of a radical, decentralized abolitionist collective, Lou works on building alternative justice systems, and advocates for non-punitive, non-coercive transformations of behavior and systems.\n",
            "eventId": "swarm_summit_2023",
            "twitter": "https://twitter.com/louviq",
            "photo": "https://summit.ethswarm.org/media/avatars/lou_CT8GFxZ.png"
        }
    ],
    "playbackId": "6d9cp4345e3gmdit",
    "eventId": "swarm_summit_2023"
}