{"id":"exploring_the_past_present_and_future_of_zkevms","name":"Exploring the past, present, and future of zkEVMs","description":"The past two years have witnessed significant progress in zkEVMs, with several of them being launched. In this panel, we will delve into the challenges encountered and the approaches and solutions used to overcome them. Additionally, we aim to gain insight into the upcoming challenges and the goals to be achieved.","start":1699947000000,"end":1699949700000,"stageId":"emirgan_1","speakers":[{"id":"leonardo_alt","name":"Leonardo Alt","bio":"Leo currently works on powdr building zkVM tooling. Before that he worked on Formal Verification and Solidity at the Ethereum Foundation for many years, mostly doing research and building tools for formal verification of smart contracts and zk circuits. Leo also holds a PhD in Computer Science, focused on SMT solving and software verification.","eventId":"evm_summit","twitter":"","photo":"https://pbs.twimg.com/profile_images/1458195165819060238/4H4wKJto_400x400.jpg"},{"id":"jordi_baylina","name":"Jordi Baylina","bio":"Jordi is an early adopter of Web3 technologies. He co-founded and became an active member of the White Hat Group, which played a major role in rescuing funds from TheDAO and Parity Multisig hacks. Jordi has also co-founded several Web3 startups including Giveth.io, the first donation tracking platform on Ethereum. He has also co-founded DAppNode, Iden3, and Polygon Hermez. Currently, Jordi serves as the Technical Lead at Polygon Hermez zkRollup and is working on implementing the first complete zkEVM proving system.","eventId":"evm_summit","twitter":"","photo":"https://evmsummit.org/images/speakers/jordi_baylina.jpg"},{"id":"eduard_sanou","name":"Eduard Sanou","bio":"Learned zk in iden3 (now Polygon Hermez) while developing a decentralized identity protocol, and later a zkRollup.  Now working on the zkEVM CE project in PSE (EF) for nearly 2 years","eventId":"evm_summit"},{"id":"rami_khalil","name":"Rami Khalil","bio":"No description","eventId":"evm_summit","twitter":"","photo":"https://evmsummit.org/images/speakers/rami_khalil.jpg"},{"id":"orest_tarasiuk","name":"Orest Tarasiuk","bio":"No description","eventId":"evm_summit"}],"videoUrl":"Other","eventId":"evm_summit","coverImage":"/sessions/evm_summit/exploring_the_past_present_and_future_of_zkevms.jpg"}