{
  "id": "powdr_a_modular_stack_for_zkvms",
  "name": "Powdr: a modular stack for zkVMs",
  "description": "In the recent months, there has been a surge in the popularity of zkVM implementations. Many of these use specialized solutions and code, sometimes even all the way down to the cryptography, which makes these zkVMs very monolithic and non-interoperable.\n\npowdr takes a modular approach to designing and constructing zkVMs, employing multiple compilation and optimization stages to arrive at the final prover and verifier. Users can define custom instruction sets for a VM, specify how those compile to constraints, generate sub-machines and declare how to connect them. Moreover, the flexibility of powdr enables users to select from a variety of proving backends when generating the prover and verifier components.\n\nTo validate this concept, we have successfully developed a fully functional verifier that compiles (no-std) Rust code into eSTARK and Halo2 proofs via the RISC-V architecture. The RISC-V verifier enables making proofs for EVM programs without the need to write low-level circuits, for example by making proofs for revm through powdr. Moreover, a performant EVM implementation that still allows for quick development and iterations can also be developed using powdr-IR. In this talk we will present both approaches, how they can be achieved, and their trade-offs.",
  "start": 1699952100000,
  "end": 1699953000000,
  "stageId": "emirgan_1",
  "speakers": [
    {
      "id": "leonardo_alt",
      "name": "Leonardo Alt",
      "bio": "Leo currently works on powdr building zkVM tooling. Before that he worked on Formal Verification and Solidity at the Ethereum Foundation for many years, mostly doing research and building tools for formal verification of smart contracts and zk circuits. Leo also holds a PhD in Computer Science, focused on SMT solving and software verification.",
      "eventId": "evm_summit",
      "twitter": "",
      "photo": "https://pbs.twimg.com/profile_images/1458195165819060238/4H4wKJto_400x400.jpg"
    }
  ],
  "playbackId": "809bsociagpvc7t3",
  "eventId": "evm_summit",
  "coverImage": "/sessions/evm_summit/powdr_a_modular_stack_for_zkvms_thumbnail.png",
  "assetId": "809bd8bd-0147-4b14-8f78-79d24b71def2",
  "sourceId": "2e4afe2c-b93d-4a95-bf46-1b588653d645",
  "videoType": "clip"
}