{"id":"predicting_the_impact_of_evm_upgrades_on_all_deployed_contracts","name":"Predicting the impact of EVM upgrades on all deployed contracts","description":"Ethereum mainnet is an evolving platform where tremendous effort is made to ensure most projects, including opaque smart contracts are unaffected by each chain upgrade. In particular, changes to the semantics of the EVM can entail serious security issues affecting multiple protocols on chain. An important practice that the ecosystem benefits from are impact studies that aim to find affected projects or smart contracts that may misbehave if the chain’s semantics are changed at an early stage of the development process.\n\nIn this talk I will share my experience leading several of these studies for the Ethereum execution layer team. Throughout most of these we’ve developed techniques to audit, at scale, all deployed contracts against a different semantics of Ethereum. Some of these techniques involve formal methods, adapted to work at scale, and include: reverse-compilation, static program analysis with theorem proving (symvalic), and resimulation of past executions,\n\nFinally I will share insights and current and future upgrades (removal of selfdestruct, account abstraction, Verkle trees, gas cost changes) and their summary implications.\n\nWhy would this talk is important to this event\nThe event is dedicated to smart contract developers or VM designers with a high level of expertise. The author of this talk has conducted high-level security assessments that impact the entire ecosystem and sharing the learnings is prime content for the audience.\n\nMost of the audience don’t yet have the experience conducting these high level security assessments. The knowledge obtained from this talk may address this gap.","start":1699971300000,"end":1699972200000,"stageId":"emirgan_1","speakers":[{"id":"neville_grech","name":"Neville Grech","bio":"I am the Director and co-founder of Dedaub. My expertise is focused on program analysis, mostly applied to security applications. Before Dedaub I had a mostly academic career. I have authored the first work that applies static analysis to the security of smart contracts, this work was subsequently highlighted by ACM SIGPLAN and Communications of the ACM Throughout my career I've also developed novel techniques and tools in the areas of energy efficient software development, smart contracts, semantics and generative programming. Some popular tools I have codeveloped include decompilers and security analyzers for the Ethereum platform (MadMax and Gigahorse) and Java pointer and taint analysis frameworks (Doop, P/Taint and HeapDL). Previously, I was Reach High Fellow at the University of Athens, a Senior Research Associate at the University of Bristol, and have worked in industry as a Data Scientist and Software Engineer. I hold a PhD from the University of Southampton.","eventId":"evm_summit"}],"videoUrl":"Security","eventId":"evm_summit","coverImage":"/sessions/evm_summit/predicting_the_impact_of_evm_upgrades_on_all_deployed_contracts.jpg"}