{
  "id": "towards_secure_trustminimized_optimistic_rollups_on_ethereum",
  "name": "Towards Secure, Trust-minimized Optimistic Rollups on Ethereum",
  "description": "State-of-the-art optimistic rollups on Ethereum employ a monolithic interactive fraud proof mechanism that tightly couples an on-chain proof verifier with a specific L2 client program binary—oblivious to the system's higher-level semantics. We argue that this approach (1) magnifies monoculture failure risk, by precluding trust-minimized and permissionless participation using operator-chosen client software; (2) leads to an unnecessarily large and difficult-to-audit TCB; and, (3) suffers from a frequently-triggered, yet opaque upgrade process—both further increasing auditing overhead, and broadening the governance attack surface.\n\nTo address these concerns, we outline a methodology for designing a secure and resilient rollup with a minimal TCB, by facilitating opportunistic 1-of-N-version programming. Due to its unique challenges and opportunities, we ground this work concretely in the context of the Ethereum—where ORUs have gained significant traction. Specifically, we design a semantically-targeted IFP, featuring a proof system native to the EVM and its instruction set, as well as L2 consensus rules. We present an implementation in a new optimistic rollup, Specular, that opportunistically leverages Ethereum's existing client diversity with minimal source modification.",
  "start": 1699944600000,
  "end": 1699945500000,
  "stageId": "emirgan_2",
  "speakers": [
    {
      "id": "ujval_misra",
      "name": "Ujval Misra",
      "bio": "Ujval is a CS PhD student at UC Berkeley, advised by Dawn Song. His research interests broadly lie in security and privacy—particularly in the context of decentralized trust. His recent focus has been on decentralization problems in Ethereum-based L2 systems.",
      "eventId": "evm_summit",
      "twitter": "",
      "photo": "https://evmsummit.org/images/speakers/ujval_misra.jpg"
    }
  ],
  "playbackId": "",
  "eventId": "evm_summit",
  "coverImage": "/sessions/evm_summit/towards_secure_trustminimized_optimistic_rollups_on_ethereum_thumbnail.png"
}