{"id":"viruses_staying_in_the_human_body_longterm_drivers_of_aging","name":"Viruses staying in the human body long-term: drivers of aging","description":"\nThis talk by Amy Proal, PhD (PolyBio Research Foundation) will explain how humans are holobionts comprising trillions of microbial and viral organisms whose collective functioning impacts biological signaling. The viral component of this holobiont is referred to as the “human virome.” This virome contains bacteriophage and DNA/RNA viruses. Bacteriophage are viruses that infect bacteria and modulate their activity, and trillions of bacteriophage traffic human tissue and blood at any given moment.&nbsp;\n\nHowever, despite the fact that human and virus biology is intricately connected, certain DNA and RNA virome members such as herpesviruses can contribute to diseases of aging and inflammaging. These viruses have evolved a wide range of mechanisms to directly hijack the activity of the human genome, the human immune response, and human metabolism. For example, the amyloid beta “plaque” that accumulates in the Alzheimer’s brain is now being studied as a peptide that forms in response to viral pathogens in brain tissue[1].\n\nPersistent viruses can also disrupt human signaling directly connected to aging processes. For example, one network analysis uncovered dozens of viruses encoding proteins experimentally demonstrated to interact with proteins from pathways associated with human aging, including cellular senescence[2]. Viral infection can also have profound effects on host cell processes relevant to telomere biology and genome maintenance[3], with human herpesvirus 6 (HHV-6) capable of driving telomere dysfunction by directly integrating into host telomeric DNA.\n\nHuman virome-driven contributions to aging processes may be rapidly accelerating due to the COVID-19 pandemic. The SARS-CoV-2 virus driving the COVID-19 pandemic is increasingly being studied as a virus capable of long-term persistence in a wide range of human body and brain sites[4]. We may consequently be seeding the human population with yet one more virus that can drive human genome, metabolic and senescence-related dysfunction under certain conditions.\n\nIt follows that the rapid development of novel antiviral drugs, immunotherapies, and prophylactics could help control virome activity in a manner that should promote human longevity. However, development and use of these novel therapeutics must be done with great transparency. The general public must be fully engaged in the process, so that potential side effects and the “risk-reward” ratios for certain therapeutics can be thoughtfully evaluated and debated.&nbsp;\n\nReferences:\n1. Eimer WA, Vijaya Kumar DK, Navalpur Shanmugam NK, et al. Alzheimer’s Disease-Associated β-Amyloid Is Rapidly Seeded by Herpesviridae to Protect against Brain Infection. Neuron. 2018;99(1):56. doi:10.1016/J.NEURON.2018.06.030\n\n2. Teulière J, Bernard C, Bonnefous H, Martens J, Lopez P, Bapteste E. Interactomics: Dozens of Viruses, Co-evolving With Humans, Including the Influenza A Virus, may Actively Distort Human Aging. Mol Biol Evol. 2023;40(2). doi:10.1093/MOLBEV/MSAD012\n\n3. Deng Z, Wang Z, Lieberman PM. Telomeres and viruses: common themes of genome maintenance. Front Oncol. 2012;2. doi:10.3389/FONC.2012.00201\n\n4. Stein SR, Ramelli SC, Grazioli A, et al. SARS-CoV-2 infection and persistence in the human body and brain at autopsy. Nature 2022 612:7941. 2022;612(7941):758-763. doi:10.1038/s41586-022-05542-y&nbsp;","start":"2023-05-12T12:00:00.000Z","end":"2023-05-12T13:00:00.000Z","stageId":"dome","speakers":[{"id":"amy_proal","name":"Amy Proal","bio":"No description","eventId":"zuzalu_2023__longevity_biotech_conference","photo":"https://drive.google.com/file/d/1mgx7EUb3gQqeYmesnBeljZVRhAE0cMsa/view?usp=sharing"},{"id":"vitalik_buterin","name":"Vitalik Buterin","bio":"No description","eventId":"zuzalu_2023__longevity_biotech_conference","photo":"https://drive.google.com/file/d/1mgx7EUb3gQqeYmesnBeljZVRhAE0cMsa/view?usp=sharing"},{"id":"laurence_ion","name":"Laurence Ion","bio":"No description","eventId":"zuzalu_2023__longevity_biotech_conference","photo":"https://drive.google.com/file/d/1mgx7EUb3gQqeYmesnBeljZVRhAE0cMsa/view?usp=sharing"}],"videoUrl":"https://lp-playback.com/hls/58edq3jfa6rsu5yt/index.m3u8","playbackId":"58edq3jfa6rsu5yt","eventId":"zuzalu_2023__longevity_biotech_conference"}